{
  "title": "Stargirl",
  "author": "Jerry Spinelli",
  "chapters": [
    {
      "id": 1,
      "title": "Chapter 1",
      "content": "PORCUPINE NECKTIE\n\nWhen I was little, my uncle Pete had a necktie with a porcupine painted on it. I thought that necktie was just about the neatest thing in the world. Uncle Pete would stand patiently before me while I ran my fingers over the silky surface, half expecting to be stuck by one of the quills. Once, he let me wear it. I kept looking for one of my own, but I could never find one.\n\nI was twelve when we moved from Pennsylvania to Arizona. When Uncle Pete came to say good-bye, he was wearing the tie. I thought he did so to give me one last look at it, and I was grateful. But then, with a dramatic flourish, he whipped off the tie and draped it around my neck. \"It's yours,\" he said. \"Going-away present.\"\n\nI loved that porcupine tie so much that I decided to start a collection. Two years after we settled in Arizona, the number of ties in my collection was still one. Where do you find a porcupine necktie in Mica, Arizona—or anywhere else, for that matter?\n\nOn my fourteenth birthday, I read about myself in the local newspaper. The family section ran a regular feature about kids on their birthdays, and my mother had called in some info. The last sentence read: \"As a hobby, Leo Borlock collects porcupine neckties.\"\n\nSeveral days later, coming home from school, I found a plastic bag on our front step. Inside was a gift-wrapped package tied with yellow ribbon. The tag said \"Happy Birthday!\" I opened the package. It was a porcupine necktie. Two porcupines were tossing darts with their quills, while a third was picking its teeth.\n\nI inspected the box, the tag, the paper. Nowhere could I find the giver's name. I asked my parents. I asked my friends. I called my uncle Pete. Everyone denied knowing anything about it.\n\nAt the time I simply considered the episode a mystery. It did not occur to me that I was being watched. We were all being watched.\n\n* * *\n\n\"Did you see her?\"\n\nThat was the first thing Kevin said to me on the first day of school, eleventh grade. We were waiting for the bell to ring.\n\n\"See who?\" I said.\n\n\"Hah!\" He craned his neck, scanning the mob. He had witnessed something remarkable; it showed on his face. He grinned, still scanning. \"You'll know.\"\n\nThere were hundreds of us, milling about, calling names, pointing to summer-tanned faces we hadn't seen since June. Our interest in each other was never keener than during the fifteen minutes before the first bell of the first day.\n\nI punched his arm. \"Who?\"\n\nThe bell rang. We poured inside.\n\nI heard it again in homeroom, a whispered voice behind me as we said the Pledge of Allegiance:\n\n\"You see her?\"\n\nI heard it in the hallways. I heard it in English and Geometry:\n\n\"Did you see her?\"\n\nWho could it be? A new student? A spectacular blonde from California? Or from back East, where many of us came from? Or one of those summer makeovers, someone who leaves in June looking like a little girl and returns in September as a full-bodied woman, a ten-week miracle?\n\nAnd then in Earth Sciences I heard a name: \"Stargirl.\"\n\nI turned to the senior slouching behind me. \"Stargirl?\" I said. \"What kind of name is that?\"\n\n\"That's it. Stargirl Caraway. She said it in homeroom.\"\n\n\"Stargirl?\"\n\n\"Yeah.\"\n\nAnd then I saw her. At lunch. She wore an off-white dress so long it covered her shoes. It had ruffles around the neck and cuffs and looked like it could have been her great-grandmother's wedding gown. Her hair was the color of sand. It fell to her shoulders. Something was strapped across her back, but it wasn't a book bag. At first I thought it was a miniature guitar. I found out later it was a ukulele.\n\nShe did not carry a lunch tray. She did carry a large canvas bag with a life-size sunflower painted on it. The lunchroom was dead silent as she walked by. She stopped at an empty table, laid down her bag, slung the instrument strap over her chair, and sat down. She pulled a sandwich from the bag and started to eat.\n\nHalf the lunchroom kept staring, half started buzzing.\n\nKevin was grinning. \"Wha'd I tell you?\"\n\nI nodded.\n\n\"She's in tenth grade,\" he said. \"I hear she's been homeschooled till now.\"\n\n\"Maybe that explains it,\" I said.\n\nHer back was to us, so I couldn't see her face. No one sat with her, but at the tables next to hers kids were cramming two to a seat. She didn't seem to notice. She seemed marooned in a sea of staring, buzzing faces.\n\nKevin was grinning again. \"You thinking what I'm thinking?\" he said.\n\nI grinned back. I nodded. \"Hot Seat.\"\n\nHot Seat was our in-school TV show. We had started it the year before. I was producer/director, Kevin was on-camera host. Each month he interviewed a student. So far, most of them had been honor student types, athletes, model citizens. Noteworthy in the usual ways, but not especially interesting.\n\nSuddenly Kevin's eyes boggled. The girl was picking up her ukulele. And now she was strumming it. And now she was singing! Strumming away, bobbing her head and shoulders, singing, \"I'm looking over a four-leaf clover that I overlooked before.\" Stone silence all around. Then came the sound of a single person clapping. I looked. It was the lunch-line cashier.\n\nAnd now the girl was standing, slinging her bag over one shoulder and marching among the tables, strumming and singing and strutting and twirling. Heads swung, eyes followed her, mouths hung open. Disbelief. When she came by our table, I got my first good look at her face. She wasn't gorgeous, wasn't ugly. A sprinkle of freckles crossed the bridge of her nose. Mostly, she looked like a hundred other girls in school, except for two things. She wore no makeup, and her eyes were the biggest I had ever seen, like deer's eyes caught in headlights. She twirled as she went past, her flaring skirt brushing my pant leg, and then she marched out of the lunchroom.\n\nFrom among the tables came three slow claps. Someone whistled. Someone yelped.\n\nKevin and I gawked at each other.\n\nKevin held up his hands and framed a marquee in the air. \"Hot Seat! Coming Attraction—Stargirl!\"\n\nI slapped the table. \"Yes!\"\n\nWe slammed hands.",
      "quiz": []
    },
    {
      "id": 2,
      "title": "Chapter 2",
      "content": "When we got to school the next day, Hillari Kimble was holding court at the door.\n\n\"She's not real,\" Hillari said. She was sneering. \"She's an actress. It's a scam.\"\n\nSomeone called out, \"Who's scamming us?\"\n\n\"The administration. The principal. Who else? Who cares?\" Hillari wagged her head at the absurdity of the question.\n\nA hand flashed in the air: \"Why?\"\n\n\"School spirit,\" she spat back. \"They think this place was too dead last year. They think if they plant some nutcase in with the students—\"\n\n\"Like they plant narcs in schools!\" someone else shouted.\n\nHillari glared at the speaker, then continued, \"—some nutcase who stirs things up, then maybe all the little students will go to a game once in a while or join a club.\"\n\n\"Instead of making out in the library!\" chimed another voice. And everybody laughed and the bell rang and we went in.\n\nHillari Kimble's theory spread throughout the school and was widely accepted.\n\n\"You think Hillari's right?\" Kevin asked me. \"Stargirl's a plant?\"\n\nI snickered. \"Listen to yourself.\"\n\nHe spread his arms. \"What?\"\n\n\"This is Mica Area High School,\" I reminded him. \"It's not a CIA operation.\"\n\n\"Maybe not,\" he said, \"but I hope Hillari's right.\"\n\n\"Why would you hope that? If she's not a real student, we can't have her on Hot Seat.\"\n\nKevin wagged his head and grinned. \"As usual, Mr. Director, you fail to see the whole picture. We could use the show to expose her. Can't you see it?\" He did the marquee thing with his hands: \"Hot Seat Uncovers Faculty Hoax!\"\n\nI stared at him. \"You want her to be a fake, don't you?\"\n\nHe grinned ear to ear. \"Absolutely. Our ratings will go sky-high!\"\n\nI had to admit, the more I saw of her, the easier it was to believe she was a plant, a joke, anything but real. On that second day she wore bright-red baggy shorts with a bib and shoulder straps—overall shorts. Her sandy hair was pulled back into twin plaited pigtails, each tied with a bright-red ribbon. A rouge smudge appled each cheek, and she had even dabbed some oversized freckles on her face. She looked like Heidi. Or Bo Peep.\n\nAt lunch she was alone again at her table. As before, when she finished eating, she took up her ukulele. But this time she didn't play. She got up and started walking among the tables. She stared at us. She stared at one face, then another and another. The kind of bold, I'm-looking-at-you stare you almost never get from people, especially strangers. She appeared to be looking for someone, and the whole lunchroom had become very uncomfortable.\n\nAs she approached our table, I thought: What if she's looking for me? The thought terrified me. So I turned from her. I looked at Kevin. I watched him grin goofily up at her. He wiggled his fingers at her and whispered, \"Hi, Stargirl.\" I didn't hear an answer. I was intensely aware of her passing behind my chair.\n\nShe stopped two tables away. She was smiling at a pudding-bodied senior named Alan Ferko. The lunchroom was dead silent. She started strumming the uke. And singing. It was \"Happy Birthday.\" When she came to his name she didn't sing just his first name, but his full name:\n\n\"Happy Birthday, dear Alan Fer-kooooh\"\n\nAlan Ferko's face turned red as Bo Peep's pigtail ribbons. There was a flurry of whistles and hoots, more for Alan Ferko's sake, I think, than hers. As Stargirl marched out, I could see Hillari Kimble across the lunchroom rising from her seat, pointing, saying something I could not hear.\n\n\"I'll tell you one thing,\" Kevin said as we joined the mob in the hallways, \"she better be fake.\"\n\nI asked him what he meant.\n\n\"I mean if she's real, she's in big trouble. How long do you think somebody who's really like that is going to last around here?\"\n\nGood question.\n\nMica Area High School—MAHS—was not exactly a hotbed of nonconformity. There were individual variants here and there, of course, but within pretty narrow limits we all wore the same clothes, talked the same way, ate the same food, listened to the same music. Even our dorks and nerds had a MAHS stamp on them. If we happened to somehow distinguish ourselves, we quickly snapped back into place, like rubber bands.\n\nKevin was right. It was unthinkable that Stargirl could survive—or at least survive unchanged—among us. But it was also clear that Hillari Kimble was at least half right: this person calling herself Stargirl may or may not have been a faculty plant for school spirit, but whatever she was, she was not real.\n\nShe couldn't be.\n\nSeveral times in those early weeks of September, she showed up in something outrageous. A 1920s flapper dress. An Indian buckskin. A kimono. One day she wore a denim miniskirt with green stockings, and crawling up one leg was a parade of enamel ladybug and butterfly pins. \"Normal\" for her were long, floor-brushing pioneer dresses and skirts.\n\nEvery few days in the lunchroom she serenaded someone new with \"Happy Birthday.\" I was glad my birthday was in the summer.\n\nIn the hallways, she said hello to perfect strangers. The seniors couldn't believe it. They had never seen a tenth-grader so bold.\n\nIn class she was always flapping her hand in the air, asking questions, though the question often had nothing to do with the subject. One day she asked a question about trolls—in U.S. History class.\n\nShe made up a song about isosceles triangles. She sang it to her Plane Geometry class. It was called \"Three Sides Have I, But Only Two Are Equal.\"\n\nShe joined the cross-country team. Our home meets were held on the Mica Country Club golf course. Red flags showed the runners the way to go. In her first meet, out in the middle of the course, she turned left when everyone else turned right. They waited for her at the finish line. She never showed up. She was dismissed from the team.\n\nOne day a girl screamed in the hallway. She had seen a tiny brown face pop up from Stargirl's sunflower canvas bag. It was her pet rat. It rode to school in the bag every day.\n\nOne morning we had a rare rainfall. It came during her gym class. The teacher told everyone to come in. On the way to the next class they looked out the windows. Stargirl was still outside. In the rain. Dancing.\n\nWe wanted to define her, to wrap her up as we did each other, but we could not seem to get past \"weird\" and \"strange\" and \"goofy.\" Her ways knocked us off balance. A single word seemed to hover in the cloudless sky over the school:\n\nHUH?\n\nEverything she did seemed to echo Hillari Kimble: She's not real…She's not real…\n\nAnd each night in bed I thought of her as the moon came through my window. I could have lowered my shade to make it darker and easier to sleep, but I never did. In that moonlit hour, I acquired a sense of the otherness of things. I liked the feeling the moonlight gave me, as if it wasn't the opposite of day, but its underside, its private side, when the fabulous purred on my snow-white sheet like some dark cat come in from the desert.\n\nIt was during one of these nightmoon times that it came to me that Hillari Kimble was wrong. Stargirl was real.",
      "quiz": []
    },
    {
      "id": 3,
      "title": "Chapter 3",
      "content": "We fought daily, Kevin and I.\n\nMy main job as producer was to recruit people for the Hot Seat. After I signed someone up, Kevin began researching the person, getting his questions ready.\n\nEvery day he asked me, \"Did you sign her up?\"\n\nEvery day I answered no.\n\nHe got frustrated.\n\n\"What do you mean, no? Don't you want to sign her up?\"\n\nI told him I wasn't sure.\n\nHis eyes bugged out. \"Not sure? How can you not be sure? We high-fived in the lunchroom weeks ago. We were thinking Stargirl mini-series, even. This is a Hot Seat from heaven.\"\n\nI shrugged. \"That was then. Now I'm not sure.\"\n\nHe looked at me like I had three ears. \"What's there to be not sure about?\"\n\nI shrugged.\n\n\"Well then,\" he said, \"I'll sign her up.\" He walked away.\n\n\"You'll have to find another director, then,\" I said.\n\nHe stopped. I could almost see the steam rising from his shoulders. He turned, pointed. \"Leo, you can be a real jerk sometimes.\" He walked off.\n\nIt was uncomfortable. Kevin Quinlan and I usually agreed on everything. We had been best friends since arriving in Arizona the same week four years before. We both thought the prickly pear cactus looked like Ping-Pong paddles with whiskers, and that saguaros looked like dinosaur mittens. We both loved strawberry-banana smoothies. We both wanted to go into television. Kevin often said he wanted to be a sleazy talk show host, and he wasn't kidding. I wanted to be a sports announcer or news anchor. We conceived Hot Seat together and convinced the faculty to let us do it. It was an instant hit. It quickly became the most popular thing in school.\n\nSo why was I balking?\n\nI didn't know. I had some vague feelings, but the only one I could identify was a warning: Leave her alone.\n\nIn time \"Hillari's Hypothesis\" (so called by Kevin) about Stargirl's origins gave way to other theories.\n\nShe was trying to get herself discovered for the movies.\n\nShe was sniffing fumes.\n\nShe was homeschooling gone amok.\n\nShe was an alien.\n\nThe rat she brought to school was only the tip of the iceberg. She had hundreds of them at home, some as big as cats.\n\nShe lived in a ghost town in the desert.\n\nShe lived in a bus.\n\nHer parents were circus acrobats.\n\nHer parents were witches.\n\nHer parents were brain-dead vegetables in a hospital in Yuma.\n\nWe watched her sit down in class and pull from her canvas bag a blue and yellow ruffled curtain that she draped over three sides of her desk. We saw her set out a three-inch clear glass vase and drop into it a white and yellow daisy. She did and undid this in every class she attended, six times a day. Only on Monday mornings was the daisy fresh. By last period the petals were drooping. By Wednesday the petals began to fall, the stem to sag. By Friday the flower hung down over the rim of the waterless vase, its dead stump of a head shedding yellow dust in the pencil groove.\n\nWe joined her as she sang \"Happy Birthday\" to us in the lunchroom. We heard her greet us in the hallways and classrooms, and we wondered how she knew our names and our birthdays.\n\nHer caught-in-headlights eyes gave her a look of perpetual astonishment, so that we found ourselves turning and looking back over our shoulders, wondering what we were missing.\n\nShe laughed when there was no joke. She danced when there was no music.\n\nShe had no friends, yet she was the friendliest person in school.\n\nIn her answers in class, she often spoke of sea horses and stars, but she did not know what a football was.\n\nShe said there was no television in her house.\n\nShe was elusive. She was today. She was tomorrow. She was the faintest scent of a cactus flower, the flitting shadow of an elf owl. We did not know what to make of her. In our minds we tried to pin her to a corkboard like a butterfly, but the pin merely went through and away she flew.\n\nKevin wasn't the only one. Other kids pestered me: \"Put her on the Hot Seat!\"\n\nI lied. I said she was only a tenth-grader and you had to be at least a junior to be on Hot Seat.\n\nMeanwhile, I kept my distance. I observed her as if she were a bird in an aviary. One day I turned a corner and there she was, coming right at me, the long skirt softly rustling, looking straight at me, surrounding me with those eyes. I turned and trotted off the other way. Seating myself in my next class, I felt warm, shaken. I wondered if my foolishness showed. Was I myself becoming goofy? The feeling I had had when I saw her around the corner had been something like panic.\n\nThen one day after school I followed her. I kept at a safe distance. Since she was known not to take a bus, I expected the walk to be short. It wasn't. We trekked all over Mica, past hundreds of grassless stone-and-cactus front yards, through the Tudorized shopping center, skirting the electronics business park around which the city had been invented a mere fifteen years before.\n\nAt one point she pulled a piece of paper from her bag. She consulted it. She seemed to be reading house numbers as she walked along. Abruptly she turned up a driveway, went to the front door, and left something in the mailbox.\n\nI waited for her to move off. I looked around—no one on the street. I went to the mailbox, pulled out a homemade card, opened it. Each tall letter was a different painted color. The card said: CONGRATULATIONS! It was unsigned.\n\nI resumed following her. Cars pulled into driveways. It was dinnertime. My parents would be wondering.\n\nShe took the rat from the bag and put it on her shoulder. Riding there, the rat faced backward, its tiny triangular face peeping out of her sand-colored hair. I could not see its beady black eyes, but I guessed it was looking at me. I fancied it was telling her what it saw. I fell farther back.\n\nShadows crossed the streets.\n\nWe passed the car wash and the bike shop. We passed the country club golf course, the biggest spread of green grass until the next golf course in the next town. We passed the \"Welcome to Mica\" sign. We were walking westward. There was us and the highway and the desert and the sun blazing above the Maricopa Mountains. I wished I had my sunglasses.\n\nAfter a while she veered from the highway. I hesitated, then followed. She was walking directly into the setting sun, now a great orange perched atop the mountain crests. For a minute the mountains were the same dusky lavender as her sand-skimming skirt. With every step the silence grew, as did my sense that she knew—had known all along—that she was being followed. Or more, that she was leading me. She never looked back.\n\nShe strummed her ukulele. She sang. I could no longer see the rat. I imagined it was dozing in the curtain of her hair. I imagined it was singing along. The sun lay down behind the mountains.\n\nWhere was she going?\n\nIn the gathering dusk, the saguaros flung shadows of giants across the pebbled earth. The air was cool on my face. The desert smelled of apples. I heard something—a coyote? I thought of rattlesnakes and scorpions.\n\nI stopped. I watched her walk on. I stifled an impulse to call after her, to warn her…of what?\n\nI turned and walked, then ran, back to the highway.",
      "quiz": []
    },
    {
      "id": 4,
      "title": "Chapter 4",
      "content": "At Mica Area High School, Hillari Kimble was famous for three things: her mouth, The Hoax, and Wayne Parr.\n\nHer mouth spoke for itself, most often to complain.\n\nThe episode that became known as Hillari's Hoax took place in her sophomore year, when she tried out for cheerleading. Her face and hair and figure were right enough, and she surely had the mouth—she made the squad easily. And then she stunned everyone by turning it down. She said she just wanted to prove that she could do it. She said she had no intention of yammering and bouncing in front of empty bleachers (which was usually the case). And anyway, she hated sports.\n\nAs for Wayne Parr, he was her boyfriend. Mouthwise, he was her opposite: he seldom opened his. He didn't have to. All he had to do was appear. That was his job: appear. By both girls' and boys' standards, Wayne Parr was gorgeous.\n\nBut he was more—and less—than that.\n\nIn terms of achievement, Wayne Parr seemed to be nobody. He played on no sports team, joined no organization, won no awards, earned no A's. He was elected to nothing, honored for nothing—and yet, though I did not realize this until years later, he was grand marshal of our daily parade.\n\nWe did not wake up in the morning and ask ourselves, \"What will Wayne Parr wear today?\" or \"How will Wayne Parr act today?\" At least, not consciously. But on some level below awareness, that is exactly what we did. Wayne Parr did not go to football and basketball games, and by and large, neither did we. Wayne Parr did not ask questions in class or get worked up over teachers or pep rallies, and neither did we. Wayne Parr did not much care. Neither did we.\n\nDid Parr create us, or was he simply a reflection of us? I didn't know. I knew only that if you peeled off one by one all the layers of the student body, you would have found at the core not the spirit of the school, but Wayne Parr. That's why, in our sophomore year, I had recruited Parr for the Hot Seat. Kevin was surprised.\n\n\"Why him?\" Kevin said. \"What's he ever done?\"\n\nWhat could I say? That Parr was a worthy subject precisely because he did nothing, because he was so monumentally good at doing nothing? I had only a vague insight, not the words. I just shrugged.\n\nThe highlight of that Hot Seat came when Kevin asked Parr who was his hero, his role model. It was one of Kevin's standard questions.\n\nParr answered, \"GQ.\"\n\nIn the control room, I did a double take. Was the sound working right?\n\n\"GQ?\" Kevin repeated dumbly. \"Gentleman's Quarterly? The magazine?\"\n\nParr did not look at Kevin. He looked straight at the camera. He nodded smugly. He went on to say he wanted to become a male model, his ultimate ambition was to be on the cover of GQ. And right there he posed for the camera—he had that disdainful model look down pat—and suddenly I could see it: the jaw square as the corner of a cover, the chiseled cheeks, the perfect teeth and hair.\n\nThat, as I say, took place toward the end of our sophomore year. I thought then that Wayne Parr would always reign as our grand marshal. How could I have known that he would soon be challenged by a freckle-nosed homeschooler?",
      "quiz": []
    },
    {
      "id": 5,
      "title": "Chapter 5",
      "content": "The call came from Kevin on a Friday night. He was at the football game. \"Quick! Hurry! Drop whatever you're doing! Now!\"\n\nKevin was one of the few who went to games. The school kept threatening to drop football because of low attendance. They said ticket receipts were barely enough to pay for electricity to light the field.\n\nBut Kevin was screaming on the phone. I jumped in the family pickup and raced to the stadium.\n\nI bolted from the truck. Kevin was at the gate, windmilling his arm: \"Hurry!\" I threw the two-dollar admission at the ticket window and we raced for the field. \"See better up here,\" he said, yanking me into the stands. It was halftime. The band was on the field, all fourteen of them. Among the students it was known as \"The World's Smallest Standing Band.\" There weren't enough of them to form recognizable letters or shapes—except for a capital \"I\"—so they didn't march much at halftimes of games. They mostly stood. In two rows of seven each, plus the student conductor. No majorettes. No color guard. No flag and rifle girls.\n\nExcept this night. This night Stargirl Caraway was on the field with them. As they played, rooted in their places, she pranced around the grass in her bare feet and long lemon-yellow dress. She roamed from goalpost to goalpost. She swirled like a dust devil. She marched stiffly like a wooden soldier. She tootled an imaginary flute. She pogoed into the air and knocked her bare heels together. The cheerleaders gaped from the sidelines. A few people in the stands whistled. The rest—they barely outnumbered the band—sat there with What is this? on their faces.\n\nThe band stopped playing and marched off the field. Stargirl stayed. She was twirling down the forty-yard line when the players returned. They did a minute of warm-up exercises. She joined in: jumping jacks, belly whomps. The teams lined up for the second half kickoff. The ball perched on the kicking tee. She was still on the field. The referee blew his whistle, pointed to her. He flapped his hand for her to go away. Instead, she dashed for the ball. She plucked it off the tee and danced with it, spinning and hugging it and hoisting it into the air. The players looked at their coaches. The coaches looked at the officials. The officials blew their whistles and began converging on her. The sole policeman on duty headed for the field. She punted the ball over the visiting team's bench and ran from the field and out of the stadium.\n\nEveryone cheered: the spectators, the cheerleaders, the band, the players, the officials, the parents running the hot dog stand, the policeman, me. We whistled and stomped our feet on the aluminum bleachers. The cheerleaders stared up in delighted surprise. For the first time, they were hearing something come back from the stands. They did cartwheels and backflips and even a three-tier pyramid. Old-timers—or as old as timers got in a city as young as Mica—said they had never heard such a racket.\n\nFor the next home game more than a thousand people showed up. Everyone but Wayne Parr and Hillari Kimble. There was a line at the ticket window. The refreshment stand ran out of hot dogs. A second policeman was called in. The cheerleaders were in their glory. They screamed up at the bleachers: \"GIMME AN E!\" The bleachers screamed back: \"EEEE!\" (We were the Electrons, in honor of the town's electronics heritage.)\n\nThe cheerleaders ran through all their routines before the first quarter was over. The band was loud and peppy. The football team even scored a touchdown. In the stands heads kept swinging to the edges of the field, to the entrance, to the streetlamp-lighted darkness behind the stadium. The sense of expectation grew as the first half came to a close. The band marched smartly onto the field. Even they were looking around.\n\nThe musicians did their program. They even formed a small, lopsided circle. They seemed to linger on the field, drawing out their notes, waiting. Finally, reluctantly, they marched to the sideline. The players returned. They kept glancing around as they did their warm-ups. When the referee raised his arm and blew his whistle for the second half to begin, a sense of disappointment fell over the stadium. The cheerleaders' shoulders sagged.\n\nShe wasn't coming.\n\nOn the following Monday, we got a shock in the lunchroom. Bleached blond and beautiful Mallory Stillwell, captain of the cheerleaders, was sitting with Stargirl. She sat with her, ate with her, talked with her, walked out with her. By sixth period the whole school knew: Stargirl had been invited to become a cheerleader and had said yes.\n\nPeople in Phoenix must have heard us buzzing. Would she wear the usual skirt and sweater like everyone else? Would she do the usual cheers? Did all the cheerleaders want this, or was it just the captain's idea? Were they jealous?\n\nCheerleading practice drew a crowd. At least a hundred of us stood by the parking lot that day, watching her learn the cheers, watching her jump around in her long pioneer dress.\n\nShe spent two weeks practicing. Halfway through the second week she wore her uniform: green-trimmed white V-neck cotton sweater, short green and white pleated skirt. She looked just like the rest of them.\n\nStill, to us she was not truly a cheerleader, but Stargirl dressed like one. She continued to strum her ukulele and sing \"Happy Birthday\" to people. She still wore long skirts on non-game days and made a home of her school desks. When Halloween arrived, everyone in her homeroom found a candy pumpkin on his or her desk. No one had to ask who did it. By then most of us had decided that we liked having her around. We found ourselves looking forward to coming to school, to seeing what bizarre antic she'd be up to. She gave us something to talk about. She was entertaining.\n\nAt the same time, we held back. Because she was different. Different. We had no one to compare her to, no one to measure her against. She was unknown territory. Unsafe. We were afraid to get too close.\n\nAlso, I think we were all waiting to see the outcome of an event that loomed larger and larger with every passing day. The next birthday coming up was Hillari Kimble's.",
      "quiz": []
    },
    {
      "id": 6,
      "title": "Chapter 6",
      "content": "Hillari herself set the stage the day before. In the middle of lunch, she got up from her table and walked over to Stargirl. For half a minute she just stood behind Stargirl's chair. Silence everywhere except for tinklings in the kitchen. Only Stargirl was still chewing. Hillari moved around to the side.\n\n\"I'm Hillari Kimble,\" she said.\n\nStargirl looked up. She smiled. She said, \"I know.\"\n\n\"My birthday is tomorrow.\"\n\n\"I know.\"\n\nHillari paused. Her eyes narrowed. She jabbed her finger in Stargirl's face. \"Don't try singing to me, I'm warning you.\"\n\nOnly those at nearby tables heard Stargirl's faint reply: \"I won't sing to you.\"\n\nHillari gave a satisfied smirk and walked off.\n\nFrom the moment we arrived at school the next day, the atmosphere bristled like cactus paddles. When the buzzer sounded for first lunch, we leaped for the doors. We swarmed into the food lines. We raced through our choices and hurried to our seats. Never had we moved so fast so quietly. At most, we whispered. We sat, we ate. We were afraid to crunch our potato chips, afraid we might miss something.\n\nHillari was first to enter. She marched in, leading her girlfriends like an invading general. In the food line, she smacked items onto her tray. She glared at the cashier. While her friends scanned the crowd for Stargirl, Hillari stared ferociously at her sandwich.\n\nWayne Parr came in and sat several tables away, as if even he was afraid of her on this day.\n\nStargirl finally came in. She went straight to the food line, blithely smiling as usual. Both she and Hillari seemed unaware of each other.\n\nStargirl ate. Hillari ate. We watched. Only the clock moved.\n\nA kitchen staffer stuck her head out over the conveyor belt and called: \"Trays!\"\n\nA voice barked back: \"Shut up!\"\n\nStargirl finished her lunch. As usual, she stuffed her wrappings into her paper bag, carried the bag to the paper-only can by the tray return window, and dropped it in. She returned to her seat. She picked up the ukulele. We stopped breathing. Hillari stared at her sandwich.\n\nStargirl began strumming and humming. She stood. She strolled between the tables, humming, strumming. Three hundred pairs of eyes followed her. She came to Hillari Kimble's table—and kept on walking, right up to the table where Kevin and I sat with the Hot Seat crew. She stopped and she sang \"Happy Birthday.\" It was Hillari's name at the end of the song, but true to her word of the day before, she did not sing it to Hillari—she sang it to me. She stood at my shoulder and looked down at me, smiling and singing, and I didn't know whether to look down at my hands or up at her face, so I did some of each. My face was burning.\n\nWhen she finished, the students burst from their silence with wild applause. Hillari Kimble stomped from the lunchroom. Kevin looked up at Stargirl and pointed at me and said what everyone must have been thinking: \"Why him?\"\n\nStargirl tilted her head, as if studying me. She grinned mischievously. She tugged on my earlobe and said, \"He's cute.\" And walked off.\n\nI was feeling nine ways at once, and they all ended up at the touch of her hand on my ear—until Kevin reached over and yanked the same earlobe. \"This keeps getting more interesting,\" he said. \"I think it's time to go see Archie.\"",
      "quiz": []
    },
    {
      "id": 7,
      "title": "Chapter 7",
      "content": "A. H. (Archibald Hapwood) Brubaker lived in a house of bones. Jawbones, hipbones, femurs. There were bones in every room, every closet, on the back porch. Some people have stone cats on their roofs; on his roof Archie Brubaker had a skeleton of Monroe, his deceased Siamese. Take a seat in his bathroom and you found yourself facing the faintly smirking skull of Doris, a prehistoric creodont. Open the kitchen cabinet where the peanut butter was kept and you were face to fossil face with an extinct fox.\n\nArchie was not morbid; he was a paleontologist. The bones were from digs he had done throughout the American West. Many were rightly his, found in his spare time. Others he collected for museums but slipped into his own pocket or knapsack instead. \"Better to sit in my refrigerator than disappear in a drawer in some museum basement,\" he would say.\n\nWhen he wasn't digging up old bones, Archie Brubaker was teaching at universities in the East. He retired at the age of sixty-five. When he was sixty-six, his wife, Ada Mae, died. At sixty-seven he moved himself and his bones west, \"to join the other fossils.\"\n\nHe chose his home for two reasons: (1) its proximity to the high school (he wanted to be near kids; he had none of his own) and (2) \"Señor Saguaro.\" Señor Saguaro was a cactus, a thirty-foot-tall giant that towered over the toolshed in the backyard. It had two arms high on the trunk. One stuck straight out; the other made a right turn upward, as if waving \"adiós!\" The waving arm was green from the elbow up; all else was brown, dead. Much of the thick, leathery skin along the trunk had come loose and crumpled in a heap about the massive foot: Señor Saguaro had lost his pants. Only his ribs, thumb-thick vertical timbers, held him up. Elf owls nested in his chest.\n\nThe old professor often talked to Señor Saguaro—and to us. He was not certified to teach in Arizona, but that did not stop him. Every Saturday morning his house became a school. Fourth-graders, twelfth-graders—all were welcome. No tests, no grades, no attendance record. Just the best school most of us had ever gone to. He covered everything from toothpaste to tapeworms and somehow made it all fit together. He called us the Loyal Order of the Stone Bone. He gave us homemade necklaces. The pendant was a small fossil bone strung on rawhide. Years before, he had told his first class, \"Call me Archie.\" He never had to say it again.\n\nAfter dinner that day, Kevin and I walked over to Archie's. Though the official class convened on Saturday morning, kids were welcome anytime. \"My school,\" he said, \"is everywhere and always in session.\"\n\nWe found him, as usual, on the back porch, rocking and reading. The porch, bathed in the red-gold light of sunset, faced the Maricopas. Archie's white hair seemed to give off a light of its own.\n\nThe moment he saw us, he put down his book. \"Students! Welcome!\"\n\n\"Archie,\" we said, then turned to greet the great cactus, as visitors were expected to do: \"Señor Saguaro.\" We saluted.\n\nWe sat on rockers; the porch was full of them. \"So, men,\" he said, \"business or pleasure?\"\n\n\"Bafflement,\" I said. \"There's a new girl in school.\"\n\nHe laughed. \"Stargirl.\"\n\nKevin's eyes popped. \"You know her?\"\n\n\"Know her?\" he said. He picked up his pipe and loaded it with cherrysweet tobacco. He always did this when settling in for a long lecture or conversation. \"Good question.\" He lit the pipe. \"Let's say she's been on the porch here quite a few times.\" White smoke puffed like Apache signals from the corner of his mouth. \"I was wondering when you'd start asking questions.\" He chuckled to himself. \"Bafflement… good word. She is different, isn't she?\"\n\nKevin and I burst into laughter and nods. At that moment I realized how much I had been craving Archie's confirmation.\n\nKevin exclaimed, \"Like another species!\"\n\nArchie cocked his head, as if he had just caught the sound of a rare bird. The pipe stem anchored a wry grin. A sweet scent filled the air about our rocking chairs. He stared at Kevin. \"On the contrary, she is one of us. Most decidedly. She is us more than we are us. She is, I think, who we really are. Or were.\"\n\nArchie talked that way sometimes, in riddles. We didn't always know what he was saying, but our ears didn't much care. We just wanted to hear more. As the sun dipped below the mountains, it fired a final dart at Archie's flashing eyebrows.\n\n\"She's homeschooled, you know. Her mother brought her to me. I guess she wanted a break from playing teacher. One day a week. Four, five—yes, five years now.\"\n\nKevin pointed. \"You created her!\"\n\nArchie smiled, puffed. \"No, that was done long before me.\"\n\n\"Some people are saying she's some kind of alien sent down here from Alpha Centauri or something,\" said Kevin. He chuckled, but not too convincingly. He half believed it.\n\nArchie's pipe had gone out. He relit it. \"She's anything but. She's an earthling if there ever was one.\"\n\n\"So it's not just an act?\" said Kevin.\n\n\"An act? No. If anybody is acting, it's us. She's as real as\"—he looked around; he picked up the tiny, wedgelike skull of Barney, a 60-million-year-old Paleocene rodent, and held it up—\"as real as Barney.\"\n\nI felt a little jolt of pride at having reached this conclusion myself.\n\n\"But the name,\" said Kevin, leaning forward. \"Is it real?\"\n\n\"The name?\" Archie shrugged. \"Every name is real. That's the nature of names. When she first showed up, she called herself Pocket Mouse. Then Mudpie. Then—what?—Hullygully, I believe. Now…\"\n\n\"Stargirl.\" The word came out whispery; my throat was dry.\n\nArchie looked at me. \"Whatever strikes her fancy. Maybe that's how names ought to be, heh? Why be stuck with just one your whole life?\"\n\n\"What about her parents?\" said Kevin.\n\n\"What about them?\"\n\n\"What do they think?\"\n\nArchie shrugged. \"I guess they agree.\"\n\n\"What do they do?\" Kevin said.\n\n\"Breathe. Eat. Clip their toenails.\"\n\nKevin laughed. \"You know what I mean. Where do they work?\"\n\n\"Mrs. Caraway, until a few months ago, was Stargirl's teacher. I understand she also makes costumes for movies.\"\n\nKevin poked me. \"The crazy clothes!\"\n\n\"Her father, Charles, works\"—he smiled at us—\"where else?\"\n\n\"MicaTronics,\" we said in chorus.\n\nI said it with wonder, for I had imagined something more exotic.\n\nKevin said, \"So where is she from?\"\n\nA natural question in a city as young as Mica. Nearly everybody had been born somewhere else.\n\nArchie's eyebrows went up. \"Good question.\" He took a long pull on the pipe. \"Some would say Minnesota, but in her case…\" He let out the smoke, his face disappearing in a gray cloud. A sweet haze veiled the sunset: cherries roasting in the Maricopas. He whispered, \"Rara avis.\"\n\n\"Archie,\" said Kevin, \"you're not making a lot of sense.\"\n\nArchie laughed, \"Do I ever?\"\n\nKevin jumped up. \"I want to put her on Hot Seat. Dorko Borlock here doesn't want to.\"\n\nArchie studied me through the smoke. I thought I saw approval, but when he spoke, he merely said, \"Work it out, men.\"\n\nWe talked until dark. We said \"adiós\" to Señor Saguaro. On our way out, Archie said, more to me than to Kevin, I thought: \"You'll know her more by your questions than by her answers. Keep looking at her long enough. One day you might see someone you know.\"",
      "quiz": []
    },
    {
      "id": 8,
      "title": "Chapter 8",
      "content": "The change began around Thanksgiving. By December first, Stargirl Caraway had become the most popular person in school.\n\nHow did it happen?\n\nWas it the cheerleading?\n\nThe last football game of the season was her first as a cheerleader. The grandstand was packed: students, parents, alumni. Never had so many people come to a football game to see a cheerleader.\n\nShe did all the regular cheers and routines. And more. In fact, she never stopped cheering. While the other girls were taking breaks, she went on jumping and yelling. She roamed. Areas that had always been ignored—the far ends of the grandstand, the spectators behind the goalposts, the snack bar parents—found themselves with their own arm-pumping cheerleader.\n\nShe ran straight across the fifty-yard line and joined the other team's cheerleaders. We laughed as they stood there with their mouths open. She cheered in front of the players' bench and was shooed away by a coach. At halftime she played her ukulele with the band.\n\nIn the second half she got acrobatic. She did cartwheels and backflips. At one point the game was stopped and three zebra-shirted officials ran toward one end zone. She had shinnied up a goalpost, tightrope-walked out to the middle of the crossbar, and was now standing there with her arms raised in a touchdown sign. She was commanded down, to a standing ovation and flashing cameras.\n\nAs we filed out afterward, no one mentioned how boring the game itself had been. No one cared that the Electrons had lost again. In his column next day, the sports editor of the Mica Times referred to her as \"the best athlete on the field.\" We couldn't wait for basketball season.\n\nWas it a Hillari Kimble backlash?\n\nSeveral days after the birthday song, I heard a shout down the hallway: \"Don't!\" I ran. A crowd was gathered at the top of a stairwell. They were all staring at something. I pushed my way through. Hillari Kimble was standing at the upper landing, grinning. She was holding Cinnamon the rat, dangling by its tail over the railing, nothing but space between it and the first floor. Stargirl was on the steps below, looking up.\n\nThe scene froze. The bell for the next class rang. Nobody moved. Stargirl said nothing, merely looked. The eight toes of Cinnamon's front paws splayed apart. Its tiny unblinking eyes were bulging, black as cloves. Again a voice rang out: \"Don't, Hillari!\" Suddenly Hillari dropped it. Someone screamed, but the rat fell only to the floor at Hillari's feet. She sent Stargirl a final sneer and left.\n\nWas it Dori Dilson?\n\nDori Dilson was a brown-haired ninth-grader who wrote poems in a looseleaf notebook half as big as herself and whose name nobody knew until the day she sat down at Stargirl's table for lunch. Next day the table was full. No longer did Stargirl eat lunch—or walk the hallways or do anything else at school—alone.\n\nWas it us?\n\nDid we change? Why didn't Hillari Kimble drop the rat to its death? Did she see something in our eyes?\n\nWhatever the reason, by the time we returned from Thanksgiving break, it was clear that the change had occurred. Suddenly Stargirl was not dangerous, and we rushed to embrace her. Calls of \"Stargirl!\" flew down the hallways. We couldn't say her name often enough. It tickled us to mention her name to strangers and watch the expressions on their faces.\n\nGirls liked her. Boys liked her. And—most remarkable—the attention came from all kinds of kids: shy mice and princesses, jocks and eggheads.\n\nWe honored her by imitation. A chorus of ukuleles strummed in the lunchroom. Flowers appeared on classroom desks. One day it rained and a dozen girls ran outside to dance. The pet shop at the Mica Mall ran out of rats.\n\nThe best chance for us to express our admiration came in the first week of December. We were gathered in the auditorium for the annual oratorical contest. Sponsored by the Arizona League of Women Voters, the event was open to any high school student who cared to show his or her stuff as a public speaker. The microphone was yours for seven minutes. Talk about anything you like. The winner would move on to the district competition.\n\nUsually only four or five students entered the contest at MAHS. That year there were thirteen, including Stargirl. You didn't have to be a judge to see that she was far and away the best. She gave an animated speech—a performance, really—titled \"Elf Owl, Call Me by My First Name.\" Her gray-brown homesteader's dress was the color of her subject. I couldn't see her freckles from the audience, but I imagined them dancing on her nose as she flicked her head this way and that. When she finished, we stomped on the floor and whistled and shouted for more.\n\nWhile the judges went through the charade of conferring, a film was shown. It was a brief documentary about the previous year's state finals. It featured the winner, a boy from Yuma. The most riveting moments of the film came not during the contest, but during its aftermath. When the boy arrived back at Yuma High, the whole school mobbed him in the parking lot: banners, cheerleaders, band music, confetti, streamers. Pumping his arms in the air, the returning hero rode their shoulders into school.\n\nThe film ended, the lights went on, and the judges proclaimed Stargirl the winner. She would now go on to the district competition in Red Rock, they said. The state finals would be held in Phoenix in April. Again and again we whooped and whistled.\n\nSuch was the acclamation we gave her in those last weeks of the year. But we also gave something to ourselves.",
      "quiz": []
    },
    {
      "id": 9,
      "title": "Chapter 9",
      "content": "In the Sonoran Desert there are ponds. You could be standing in the middle of one and not know it, because the ponds are usually dry. Nor would you know that inches below your feet, frogs are sleeping, their heartbeats down to once or twice per minute. They lie dormant and waiting, these mud frogs, for without water their lives are incomplete, they are not fully themselves. For many months they sleep like this within the earth. And then the rain comes. And a hundred pairs of eyes pop out of the mud, and at night a hundred voices call across the moonlit water.\n\nIt was wonderful to see, wonderful to be in the middle of: we mud frogs awakening all around. We were awash in tiny attentions. Small gestures, words, empathies thought to be extinct came to life. For years the strangers among us had passed sullenly in the hallways; now we looked, we nodded, we smiled. If someone got an A, others celebrated, too. If someone sprained an ankle, others felt the pain. We discovered the color of each other's eyes.\n\nIt was a rebellion she led, a rebellion for rather than against. For ourselves. For the dormant mud frogs we had been for so long.\n\nKids whose voices had never been heard before spoke up in class. \"Letters to the Editor\" filled a whole page of the school newspaper's December edition. More than a hundred students tried out for the Spring Revue. One kid started a camera club. Another wore Hush Puppies instead of sneakers. A plain, timid girl painted her toenails kelly green. A boy showed up with purple hair.\n\nNone of this was publicly acknowledged. There were no PA announcements, no TV coverage, no headlines in the Mica Times:\n\nMAHS STUDENTS ASTIR\n\nINDIVIDUALITY ERUPTS\n\nBut it was there; it was happening. I was used to peering through the lens, to framing the picture, and I could see it. I could feel it in myself. I felt lighter, unshackled, as if something I had been carrying had fallen away. But I didn't know what to do about it. There was no direction to my liberation. I had no urge to color my hair or trash my sneakers. So I just enjoyed the feeling and watched the once amorphous student body separate itself into hundreds of individuals. The pronoun \"we\" itself seemed to crack and drift apart in pieces.\n\nIronically, as we discovered and distinguished ourselves, a new collective came into being—a vitality, a presence, a spirit that had not been there before. It echoed from the rafters in the gym: \"GO, ELECTRONS!\" It sparkled in the water fountains. At the holiday assembly, the words of the alma mater had wings.\n\n\"It's a miracle!\" I gushed to Archie one day.\n\nHe stood on the edge of his back porch. He did not turn. He pulled the pipe slowly from between his lips. He spoke as if to Señor Saguaro or to the blazing mountains beyond.\n\n\"Best hope it's not,\" he said. \"The trouble with miracles is, they don't last long.\"\n\nAnd the trouble with bad times is, you can't sleep through them.\n\nIt was a golden age, those few weeks in December and January. How could I know that when the end came, I would be in the middle of it?",
      "quiz": []
    },
    {
      "id": 10,
      "title": "Chapter 10",
      "content": "All my resistance to putting Stargirl on Hot Seat vanished. \"Okay,\" I said to Kevin, \"let's do it. Schedule her.\" He started off. I grabbed his arm. \"Wait-ask her first.\"\n\nHe laughed. \"Right. Like she's gonna say no.\"\n\nNo one had ever said no to the Hot Seat. Any reluctance to answering personal or embarrassing questions always yielded to the lure of appearing on TV. If anyone could resist that lure, I figured it would be Stargirl. That day after school, Kevin came at me thumbs-up and grinning: \"It's a go! She said yes!\"\n\nFirst I was surprised. This didn't fit my impression of her. I didn't know that this was an early glimpse of something I was soon to see much more of: behind the dazzling talents and differentness, she was far more normal than I had realized.\n\nThen I was elated. We yipped. We high-fived. We saw visions of our most popular show ever.\n\nThis was mid-January. We set a date of February thirteenth, the day before Valentine's. We wanted a full month for buildup. With my resistance now gone, I jumped in with both feet. We planned a promo campaign. We got art students to do posters. We jotted down questions for Kevin to ask in case the jury ran out-fat chance of that happening. We didn't have to post the usual jury notice: dozens of kids volunteered.\n\nAnd then things changed again.\n\nIn the courtyard of our school stood a five-foot sheet of plywood in the shape of a roadrunner. It was a bulletin board, strictly for student use, always taped and tacked with messages and announcements. One day we found the following computer printout taped to the plywood roadrunner:\n\n\"I pledge allegiance to United Turtles of America and to the fruit bats of Borneo, one planet in the Milky Way, incredible, with justice and black bean burritos for all.\"\n\nHandwritten across the bottom were the words: \"This is how she says the Pledge of Allegiance.\"\n\nNo one had to tell us who \"she\" was. Apparently, she was overheard in homeroom as we said the Pledge each morning.\n\nAs far as I knew, we were not a particularly patriotic bunch. I didn't hear people saying they were offended. Some thought it was funny. Some giggled and nodded knowingly, as if to say, There she goes again. On the following mornings, more than one kid was heard reciting the new \"pledge.\"\n\nWithin days a new story wildfired through the student body. A senior girl, Anna Grisdale, lost her grandfather after a long illness. The funeral took place on a Saturday morning. For a while everything seemed routine: the crowd of people at the church, the line of cars with their headlights on, the smaller group clustered around the grave for the final farewell. After the brief graveside service, the funeral director handed everyone a long-stemmed flower. Upon leaving, each mourner laid his or her flower over the casket. This was when Anna Grisdale first noticed Stargirl.\n\nThrough her own tears Anna could see that Stargirl was crying also. She wondered if Stargirl had been at the church as well. Even more, she wondered why Stargirl was there at all. Could she have been friends with her grandfather without Anna's knowing it? Anna's mother asked her who the unfamiliar girl was.\n\nAfterward, the mourners were invited to Anna's house for lunch. About thirty came. There was a buffet of cold cuts and salads and cookies. Stargirl was there, chatting with members of the family but not eating or drinking anything.\n\nSuddenly Anna heard her mother's voice. It was no louder than the others, but it was different: \"What are you doing here?\"\n\nSudden stillness. Everyone staring.\n\nThey were in front of the picture window. Anna had never seen her mother so angry. Mrs. Grisdale had been very close to her father. They had built an addition to their house so he could live with them.\n\nShe glared down at Stargirl. \"Answer me.\"\n\nStargirl gave no reply. \"You didn't even know him, did you?\"\n\nStill Stargirl said nothing.\n\n\"Did you?\"\n\nAnd then Anna's mother was flinging open the front door and pointing, as if banishing her to the desert. \"Leave my house.\"\n\nStargirl left.\n\nDanny Pike was nine years old. He loved to ride the bicycle he had gotten for his birthday. One day after school he lost control and plowed into a mailbox. He broke his leg, but that wasn't the worst of it. A blood clot developed. He was airlifted to Children's Hospital in Phoenix, where he was operated on. For a while it was touch and go, but within a week he was on his way back home.\n\nAll this was reported in the Mica Times. As was the celebration when Danny arrived at his home on Piñon Lane. The five-column photo in the Times showed Danny on his father's shoulders, surrounded by a mob of neighbors. In the foreground was a new bike, and a big sign that read:\n\nWELCOME HOME, DANNY\n\nIt wasn't until days later that the front-page photo appeared on the plywood roadrunner. We gathered around to see something we hadn't noticed before. An arrow from a thick red felt-tip marker pointed at one of the tiny faces crowded into the frame. It was the face of a girl, beaming as if Danny Pike were her little brother back from the dead. It was Stargirl.\n\nAnd then there was the bike.\n\nThe various members of the Pike family-parents, grandparents, et al.-each thought someone else had bought Danny the new bicycle. Several days went by before they discovered to their great surprise that none of them had.\n\nSo where did the bike come from? High-schoolers who heard the story and saw the picture had a pretty good idea. Apparently the Pikes did not. The bike became the focus of a family squabble. Mr. Pike was mad because nobody he asked would admit to buying the bike-and probably because he hadn't done it himself. Mrs. Pike was mad because no way, not for at least one year, would she allow Danny back on wheels.\n\nOne night the new, still-unridden bike wound up at the Pikes' front curb with the trash cans. By the time the trash collector came the next day, it was gone.\n\nDanny got a BB gun instead.\n\nThe Pledge of Allegiance, the Grisdale funeral, the Danny Pike affair-these things were noted, but they had no immediate impact on Stargirl's popularity at school. Not so with cheerleading and the boys' basketball season.",
      "quiz": []
    },
    {
      "id": 11,
      "title": "Chapter 11",
      "content": "During the first quarter of each home game, Stargirl went over to the visitors' section and gave them a cheer. She began with an exaggerated ball-bouncing motion:\n\nDribble, Dribble!\nSis Boom Bibble!\nWe don't bite!\nWe don't nibble!\nWe just say-\n(sweeping wave)\n\"Howwww-dee, friends!\"\n(two thumbs pointing to her chest)\n\"We're the Electrons!\"\n(points to them)\n\"Who-are-YYYYYYOU?\"\n(turns head to side, cups ear)\n\nA couple of visiting cheerleaders, maybe a fan or two would call back: \"Wildcats!\" or \"Cougars!\" or whatever, but most of them just gaped at her as if to say, Who is this? Some of her fellow cheerleaders were amused, some were mortified.\n\nAt that point the only crime Stargirl could have been accused of would be corniness. But she didn't stop there. She cheered whenever the ball went in the basket, regardless of which team shot it. It was the strangest sight: the other team scores, the MAHS crowd sits glumly on their hands while Stargirl, alone, pops up cheering.\n\nAt first the other cheerleaders tried to suppress her; it was like trying to calm down a puppy. When they gave her the pleated skirt, they made a cheerleader they never imagined. She did not limit herself to basketball games. She cheered anyone, anything, anytime. She cheered the big things-honors, election winners-but she gave most of her attention to little things.\n\nYou never knew when it would happen. Maybe you were a little ninth-grade nobody named Eddie. As you're walking down the hall you see a candy wrapper on the floor. You pick it up and throw it in the nearest trash can-and suddenly there she is in front of you, pumping her arms, her honey hair and freckles flying, swallowing you whole with those enormous eyes, belting out a cheer she's making up on the spot, something about Eddie, Eddie and the trash can teaming up to wipe out litter. A mob is gathering, clapping hands in rhythm, more eyes on you than all the previous days of your life combined. You feel foolish, exposed, stupid. You want to follow the candy wrapper into the trash can. It's the most painful thing that's ever happened to you. Your brain keeps squirting out a single thought: I'm going to die…I'm going to die…\n\nAnd so, when she finally finishes and her freckles settle back onto the bridge of her nose, why don't you? Why don't you just die?\n\nBecause they're clapping for you, that's why, and whoever heard of dying while they're clapping for you? And they're smiling at you. People who never even saw you before are smiling at you and slapping your back and pumping your hand, and suddenly it seems like the whole world is calling your name, and you're feeling so good you pretty much just float on home from school. And when you go to bed that night, the last thing you see before you zonk out are those eyes, and the last thing on your face is a smile.\n\nOr maybe you showed up at school with really unusual earrings. Or you aced a test. Or broke your arm. Or got your braces off. Or maybe you weren't even a person. Maybe you were a charcoal drawing on the wall done by an art whiz. Or a really neat-looking bug out by the bike rack.\n\nWe wagged our heads and agreed what a goofy girl this was, maybe even officially crazy, but we walked away smiling and maybe not saying but all thinking the same thing: it felt good to get credit.\n\nAnd if this had been any other year, things might have just gone on and on like that. But this was the year something unbelievable was happening on the basketball court. This was the year the team was winning. Only winning.\n\nAnd that changed everything.\n\nEarly in the season no one noticed. Except for girls' tennis, we had never had good teams in anything. We expected to lose. We were comfortable with losing. In fact, most of us were oblivious to it, since we didn't even attend the games.\n\nThe year before, the basketball Electrons had won only five of twenty-six games. This year, they won their fifth game before Christmas. By early January they had won the tenth, and people began to notice that there was still a zero in the loss column.\n\n\"UNDEFEATED!\" blared a sign on the plywood roadrunner. Some said we were winning by accident. Some said the other teams were simply more rotten than we were. Some thought the sign was a joke. One thing was certain: attendance went up. By the start of February the winning streak had reached sixteen, and there wasn't an empty seat in the gym.\n\nBut something even more interesting was happening. Suddenly we were no longer comfortable with losing. In fact, we forgot how to lose. The transformation was stunning in its speed. There was no apprenticeship period, no learning curve. No one had to teach us how to be winners. One day we were bored, indifferent, satisfied losers; the next we were rabid fanatics, stomping in the grandstand, painting our faces green and white, doing the wave as if we had been perfecting it for years.\n\nWe fell in love with our team. When we spoke of it, we used the word \"we\" instead of \"they.\" The leading scorer, Brent Ardsley, seemed to have a golden glow about him as he moved through the school. And the more we loved our team, the more we hated the opposition. We used to envy them. We even applauded them to spite our own hapless teams. Now we detested the opposition and everything about them. We hated their uniforms. We hated their coaches and their fans. We hated them because they were trying to spoil our perfect season. We resented every point scored against us. And how dare they celebrate!\n\nWe began to boo. It was our first experience as booers, but you'd have thought we were veterans. We booed the other team, we booed the other coach, we booed the other fans, the referees-whatever threatened our perfect season, we booed it.\n\nWe even booed the scoreboard. We hated games that went down to the wire. We hated suspense. We loved games that were decided in the first five minutes. We wanted more than victories, we wanted massacres. The only score we would have been totally happy with would have been 100 to 0.\n\nAnd right there in the middle of it all, in the midst of this perfect season mania, was Stargirl, popping up whenever the ball went through the net, no matter which team scored, cheering everything and everybody. It was sometime in January when calls started flying from the stands: \"Siddown!\" Then came the boos. She didn't seem to notice.\n\nShe did not seem to notice.\n\nOf all the unusual features of Stargirl, this struck me as the most remarkable. Bad things did not stick to her. Correction: her bad things did not stick to her. Our bad things stuck very much to her. If we were hurt, if we were unhappy or otherwise victimized by life, she seemed to know about it, and to care, as soon as we did. But bad things falling on her-unkind words, nasty stares, foot blisters-she seemed unaware of. I never saw her look in a mirror, never heard her complain. All of her feelings, all of her attentions flowed outward. She had no ego.\n\nThe nineteenth game of the basketball season was played at Red Rock. In previous years cheerleaders had outnumbered Mica fans at away games. Not now. The convoy rolling across the desert that evening stretched for a couple of miles. By the time we were seated, there was barely room for the home-team fans.\n\nIt was the worst slaughter of the year. Red Rock was helpless. By the start of the fourth quarter we were ahead, 78 to 29. The coach put in the subs. We booed. We smelled a hundred points. We wanted blood. The coach put the starters back in. As we howled and thundered in the stands, Stargirl got up and walked from the gym. Those of us who noticed assumed she was going to the rest room. I kept glancing toward the exit. She never returned. With five seconds left in the game, the Electrons scored the hundredth point. We went nuts.\n\nStargirl had been outside the whole time, chatting with the bus driver. The other cheerleaders asked her why she left. She said she felt sorry for the Red Rock players. She felt her cheering was only making the massacre worse. Such games were no fun, she said. Your job isn't to have fun, they told her, your job is to cheer for Mica High no matter what. She just stared at them.\n\nThe team and the cheerleaders rode the same bus. When the players came out from the locker room, the cheerleaders told them what had happened. They devised a trick. They told Stargirl that someone had forgotten something in the gym, and would she please go get it. With Stargirl gone, they told the bus driver everyone was aboard, and the bus made the two-hour return trip without her.\n\nA Red Rock custodian drove her home that night. Next day in school, the cheerleaders told her it was all a big misunderstanding and acted as if they were sorry. She believed them.\n\nThe next day was February thirteenth. The Hot Seat.",
      "quiz": []
    },
    {
      "id": 12,
      "title": "Chapter 12",
      "content": "This is how Hot Seat went.\n\nIt took place in the communications center studio. There were two chairs on stage: the infamous Hot Seat itself-painted red with flames running up the legs-and an ordinary chair for the host, Kevin. Off to the side were two rows of six chairs each, the second row higher than the first. This was where the jury sat.\n\nIt was a jury in name only. The twelve members did not vote or render a verdict. Their job was to ask questions, to give the Hot Seat its heat: ticklish questions, embarrassing questions, nosy questions. But not mean or hurtful questions. The idea was to make the subject squirm, not roast.\n\nIn the spirit of mock inquisition, we called the subject the \"victim.\" And why would anyone want to be the victim? The lure of TV. The chance to confess-or lie-before a camera and before peers instead of parents. But I doubted the usual reasons applied to Stargirl.\n\nThere were three cameras: one for the stage, one for the jury, and Chico. Chico was the handheld close-up camera. According to Mr. Robineau, our faculty advisor, a student named Chico once begged him to be a close-up camera kid. Mr. Robineau gave him a tryout, but Chico was so skinny he practically collapsed under the camera. The job went to someone else and Chico went to the weight room. By the following year Chico had muscles, and the camera was like nothing on his shoulder. He got the job, and he was brilliant at it. He gave the camera his own name. \"We are one,\" he said. When he graduated, his name stayed behind, and from then on the close-up camera and its operator were a unit called Chico.\n\nThe host and the victim were each fitted with a thimble-size clip-on mike; the jury passed around a hand mike. Opposite the stage was the glassed-in control room, sound-insulated from the rest of the studio. That's where I worked, wearing my headset, watching the monitors, directing the shots. I stood at the shoulder of the technical director, or TD. He sat at a rack of buttons, punching up the shots I ordered. Also in the control room were the graphics and audio people. Mr. Robineau was there as faculty overseer, but basically the students worked everything.\n\nKevin's job was to get things started: intro the victim, ask a few opening questions, stir things up if the jury was slow. Usually the jury was on the ball. Typical questions: \"Does it bother you that you're so short?\" \"Is it true that you like so-and-so?\" \"Do you wish you were good-looking?\" \"How often do you take a shower?\"\n\nIt almost always added up to entertainment. At the end of the half hour, as we cued credits and music, there was always a good feeling in the air, and everyone-victim, jury members, studio crew-mingled and became students again.\n\nWe filmed the shows after school, then broadcast them that night-prime time-on local cable. About ten thousand homes. Our own surveys said at least fifty percent of the student body watched any given show. We outdrew most of the hot sitcoms. We expected to top ninety percent for the Stargirl show.\n\nBut I had a secret: I wished no one would watch.\n\nIn the month since we had scheduled the show, Stargirl's popularity had dropped out of sight. Gone were ukuleles from the lunchroom. More and more kids saw her cheerleading behavior as undermining the basketball team and its perfect record. I was afraid the boos for her might spread from the court to the studio. I was afraid the show might turn ugly.\n\nWhen Stargirl came in that day after school, Kevin gave her the usual briefing while Mr. Robineau and I checked out the equipment. As the jury members straggled in, they were not clowning around or tap-dancing on the stage as jurors usually did. They went right to their seats. Stargirl was the one tap-dancing. And mugging for the cameras with Cinnamon the rat licking her nose. Kevin was cracking up, but the faces of the jurors were grim. One of them was Hillari Kimble. My bad feeling got worse.\n\nI retreated to the control room and shut the door. I checked communications with the cameras. We were ready. Kevin and Stargirl took their seats. I took one last look through the plate glass that separated the set from the control room. For the next half hour I would see the world through four monitors. \"Okay, everybody,\" I announced, \"here we go.\" I cut the studio mike. I looked over my control-room mates. \"We all set?\" Everyone nodded.\n\nJust then Stargirl lifted one of Cinnamon's front paws and waved it at the control room and said in a squeaky voice, \"Hi, Leo.\"\n\nI froze. I came unraveled. I didn't know she knew my name. I just stood there like a dummy. Finally I waggled my fingers at the rat and mouthed the words \"Hi, Cinnamon,\" although they couldn't hear me on the other side of the glass.\n\nI took a deep breath. \"Okay, ready music, ready intro.\" I paused. \"Music, intro.\"\n\nThis was the moment I lived for, launching the show. I was the director, the maestro, I called the shots. On the monitors before me I watched the program unfold according to my commands. But on this day the thrill was missing. I felt only a dark dread snaking along the cables.\n\n\"Greetings…and welcome to Hot Seat…\"\n\nKevin went through the opening spiel. Kevin loved to be on camera. He was ideal for a show like this, which made good use of his smirky grin and arching, Did-I-really-hear-you-say-that? eyebrows.\n\nHe turned to Stargirl. Then, impromptu, he reached out and stroked the nose of Cinnamon, who was perched on Stargirl's shoulder. \"Want to hold him?\" she said. Kevin gave the camera a Should-I look. \"Sure,\" he said.\n\n\"Ready, Chico, rat,\" I said into my headset mike.\n\n\"Ready\" was always first in the command sequence.\n\nChico zoomed in.\n\n\"Chico.\"\n\nTD punched up Chico. The camera followed Cinnamon from Stargirl's hands to Kevin's. No sooner was the rat in Kevin's lap than it scampered up his chest and darted between two buttons into his shirt. Kevin yipped and squirmed. \"It scratches!\"\n\n\"He has fingernails,\" Stargirl said calmly. \"He won't hurt you.\"\n\nChico nailed Cinnamon poking his head out from between the two buttons. Mr. Robineau stuck a thumbs-up in front of my face.\n\nKevin gave the camera his Ain't-I-something face. He turned again to Stargirl. \"You know, ever since you showed up at school this year, we've been wanting to put you on the Hot Seat.\"\n\nStargirl stared at him. She turned to the live camera. Her eyes were growing wider…\n\nSomething was happening.\n\n…and wider…\n\n\"Chico!\" I barked.\n\nChico moved in, crouching, giving it a little upshot. Terrific. \"Closer, closer,\" I said.\n\nStargirl's wonderstruck eyes practically filled the screen. I checked the long-shot monitor. She was frozen, rigid, as if electrified to the chair. Someone smacked my shoulder. I turned. Mr. Robineau was laughing, saying something. I lifted one earphone. \"She's joking,\" he repeated. And suddenly I saw. She was taking \"Hot Seat\" literally. She was milking it for all it was worth, and judging from the blank stares of Kevin and the jury, Mr. Robineau and I were the only ones who got the joke.\n\nStargirl's hands were rising now from the arms of the Hot Seat…\n\n\"Ready one,\" I called. \"One!\"\n\nCamera One, not there at first but getting it now, the long shot, nailing her as her hands came off the chair arms, fingers spread wide, you could almost see her fingertips smoking…\n\nHold it, I prayed, hold it…\n\n…as her horrified eyes swung down over the side of the chair, the Hot Seat, saw the painted flames…\n\n\"EEEEEEEEEEEEYIKES!\"\n\nHer scream bent instrument dials like palms in a hurricane. The rat leaped from Kevin's shirt. The TV image quaked as my Camera One man flinched, but he recovered and caught her standing now on the front edge of the stage, bending over with her rear end in the camera, flapping her hand behind her, fanning her smoking fanny.\n\nFinally Kevin got it. He went nuts.\n\n\"One, pull back, get Kevin in it. Ready…One.\"\n\nKevin was doubled up, tipping out of his chair, on his knees on the stage. His laughter flooded the control room. The rat ran over his hands and hopped down the single stage step…\n\n\"The rat!\" I yelled. \"Two, get the rat!\"\n\nBut Two couldn't get the rat because the rat was nosing around Two's feet and Two was bolting from his camera.\n\n\"Chico, rat!\"\n\nChico dived. He was flat on the floor, feeding the live screen a brilliant shot of the rat heading over to the jury, the jury members scrambling, taking off, climbing onto their seats.\n\nForget the \"Readys\"; things were happening too fast. The cameras were dancing, feeding the monitors. I barked commands. TD was punching his button rack like some hard-rock keyboarder.\n\nStargirl's pantomime remains the best I have ever seen. Mr. Robineau kept squeezing my shoulder. As he said later, it was the greatest moment in Hot Seat history.\n\nBut because of what followed, no audience would ever see it.",
      "quiz": []
    },
    {
      "id": 13,
      "title": "Chapter 13",
      "content": "The Hot Seat episode aired the next day.\n\nIt was the most-watched episode in the history of MAHS-TV. Kids crowded into classrooms to see it. Teachers stopped their lessons. Even the principal watched.\n\nAnd then the questions continued. The jury—a panel of students—fired questions at her. Some were curious. Some were hostile.\n\n\"Why do you cheer for the other team?\"\n\n\"Because they're people too,\" she said. \"And sometimes they need cheering.\"\n\n\"Why do you dress so weird?\"\n\n\"I dress how I feel,\" she said. \"Don't you?\"\n\n\"Do you think you're better than us?\"\n\nShe looked surprised. \"No,\" she said. \"I think I'm me. And you're you. And that's all anyone can be.\"\n\nThe questions got tougher. The jury pushed harder. They wanted to break her. They wanted to see her crack.\n\nBut she didn't crack. She answered every question with the same calm, honest simplicity. She smiled. She laughed. She was completely at ease.\n\nWhen it was over, the audience sat in silence. Nobody knew what to say. Nobody knew what to think.\n\nI looked at Kevin. He was stunned.\n\n\"That was...\" he started.\n\n\"I know,\" I said.\n\nWe didn't have words for what we had just seen. It was like watching someone walk through fire and come out the other side without a single burn.\n\nStargirl had conquered Hot Seat. And in doing so, she had conquered us all.",
      "quiz": [
        {
          "question": "How popular was the Stargirl Hot Seat episode?",
          "options": [
            "Nobody watched it",
            "It was the most-watched episode ever",
            "Only a few students saw it",
            "It was average"
          ],
          "correctIndex": 1
        },
        {
          "question": "How did Stargirl handle the tough questions from the jury?",
          "options": [
            "She got angry",
            "She cried",
            "She answered calmly and honestly",
            "She refused to answer"
          ],
          "correctIndex": 2
        }
      ]
    },
    {
      "id": 14,
      "title": "Chapter 14",
      "content": "After the Hot Seat episode, everything changed.\n\nSuddenly, Stargirl was popular. Kids who had mocked her now wanted to be her friend. Kids who had ignored her now wanted to sit with her at lunch.\n\nGirls started wearing long skirts. They started braiding their hair with ribbons. They started carrying bags like hers.\n\nBoys started growing their hair out. They started wearing vintage clothes. They started being nicer to people.\n\nIt was like a switch had been flipped. One day Stargirl was an outcast. The next day she was a trendsetter.\n\nPeople started imitating her. They started singing \"Happy Birthday\" to strangers. They started leaving anonymous notes of encouragement in lockers. They started doing random acts of kindness.\n\nThe Stargirl Effect, people called it. It was spreading through the school like wildfire.\n\nEven Hillari Kimble noticed. She didn't like it.\n\n\"She's a fad,\" Hillari declared. \"She'll be forgotten in a month.\"\n\nBut Hillari was wrong. Stargirl wasn't a fad. She was a force of nature.\n\nAnd I was falling for her.\n\nI didn't want to admit it. I didn't want to be like everyone else, jumping on the Stargirl bandwagon. But I couldn't help it.\n\nThere was something about her. Something I couldn't resist. Something that pulled me toward her like gravity.\n\nI was falling. And I didn't know how to stop.",
      "quiz": [
        {
          "question": "What happened after the Hot Seat episode?",
          "options": [
            "Stargirl became unpopular",
            "Nothing changed",
            "Stargirl became popular and a trendsetter",
            "Stargirl left the school"
          ],
          "correctIndex": 2
        },
        {
          "question": "What was 'The Stargirl Effect'?",
          "options": [
            "People being mean",
            "People imitating her kindness and style",
            "People ignoring her",
            "A TV show"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 15,
      "title": "Chapter 15",
      "content": "I found out she knew my name.\n\nIt happened in the hallway, between classes. I was walking to history when I heard someone call out: \"Leo!\"\n\nI turned. It was Stargirl.\n\nShe was standing by her locker, smiling at me. Cinnamon was on her shoulder. The sun from the window behind her made her hair glow.\n\n\"Hi, Leo,\" she said.\n\nI froze. She knew my name. How did she know my name?\n\n\"Hi,\" I managed to say.\n\nShe walked toward me. \"I liked your show,\" she said. \"Hot Seat. You and Kevin do a good job.\"\n\n\"Thanks,\" I said. My voice sounded strange. Like it was coming from far away.\n\n\"I know you've been watching me,\" she said.\n\nMy face went red. \"I—\"\n\nShe laughed. \"It's okay. I've been watching you too.\"\n\nShe turned and walked away. I stood there, unable to move. Unable to breathe.\n\nShe had been watching me. She knew I had been watching her. And she didn't mind.\n\nWhat did that mean? What was happening?\n\nI didn't know. I couldn't think. All I could do was stand there, watching her disappear into the crowd, my heart pounding in my chest.\n\nShe knew my name. She had been watching me.\n\nI floated through the rest of the day.",
      "quiz": [
        {
          "question": "What surprised Leo in the hallway?",
          "options": [
            "Stargirl ignored him",
            "Stargirl knew his name",
            "Stargirl was angry at him",
            "Kevin called him"
          ],
          "correctIndex": 1
        },
        {
          "question": "What did Stargirl reveal to Leo?",
          "options": [
            "She hated the Hot Seat show",
            "She had been watching him too",
            "She was leaving school",
            "She wanted to join Hot Seat"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 16,
      "title": "Chapter 16",
      "content": "She started leaving things on my desk.\n\nA single flower. A note with a smiley face. A piece of candy. A small origami crane.\n\nI never saw her do it. The gifts just appeared, like magic. Every day something new.\n\nThe other kids noticed. They whispered. They pointed. They laughed.\n\n\"Leo's got a girlfriend,\" someone said.\n\n\"Stargirl likes Leo,\" said another.\n\nI didn't know what to think. I didn't know what to do. Part of me was thrilled. Part of me was terrified.\n\nKevin thought it was hilarious. \"Dude, she's totally into you,\" he said.\n\n\"I know,\" I said.\n\n\"So what are you going to do about it?\"\n\nI didn't know. That was the problem. I didn't know what to do.\n\nI liked her. I really liked her. But she was so... different. So unusual. So not like anyone else.\n\nIf I dated her, what would people think? What would they say? Would they laugh at me? Would they avoid me?\n\nI was ashamed of myself for thinking these things. But I couldn't help it. I was worried about what people would think.\n\nI wasn't brave like her. I wasn't fearless. I cared what people thought.\n\nAnd that made me hate myself a little.",
      "quiz": [
        {
          "question": "What did Stargirl start leaving on Leo's desk?",
          "options": [
            "Homework assignments",
            "Small gifts like flowers and origami",
            "Complaints",
            "Love letters"
          ],
          "correctIndex": 1
        },
        {
          "question": "What worried Leo about potentially dating Stargirl?",
          "options": [
            "He didn't like her",
            "He was worried what people would think",
            "She was moving away",
            "Kevin told him not to"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 17,
      "title": "Chapter 17",
      "content": "She sang to me.\n\nIt was at lunch. I was sitting with Kevin, eating my sandwich, when I heard the ukulele. I looked up.\n\nStargirl was walking toward me, strumming her ukulele, singing.\n\nThe whole cafeteria went quiet. Everyone watched. Everyone listened.\n\nShe sang a love song. An old one, from the 1930s. Something about moonlight and roses and falling in love.\n\nShe stopped right in front of my table. She finished the song. She smiled at me.\n\nI wanted to disappear. I wanted to sink through the floor. I could feel everyone's eyes on me. I could hear the whispers, the giggles.\n\nBut I also wanted to stand up and hug her. I wanted to tell her how amazing she was. How brave. How beautiful.\n\nI didn't do either. I just sat there, my face burning, my heart racing.\n\nShe finished the song and walked away. The cafeteria erupted in applause and laughter.\n\nKevin slapped me on the back. \"Dude,\" he said. \"You're famous now.\"\n\nI was more than famous. I was marked. I was Stargirl's boyfriend, whether I liked it or not.\n\nThe strange thing was, I think I liked it. I think I liked it a lot.\n\nI just didn't know how to show it.",
      "quiz": [
        {
          "question": "What did Stargirl do in the cafeteria?",
          "options": [
            "She gave a speech",
            "She sang a love song to Leo",
            "She danced alone",
            "She had a fight"
          ],
          "correctIndex": 1
        },
        {
          "question": "How did Leo feel about the public serenade?",
          "options": [
            "Purely embarrassed",
            "He hated it completely",
            "Conflicted - embarrassed but also touched",
            "He didn't care at all"
          ],
          "correctIndex": 2
        }
      ]
    },
    {
      "id": 18,
      "title": "Chapter 18",
      "content": "We went on our first date.\n\nShe picked me up at my house. She was driving an old pickup truck that looked like it belonged in a museum. It was painted bright yellow with flowers on the doors.\n\n\"Where are we going?\" I asked.\n\n\"You'll see,\" she said.\n\nShe drove us out of town, into the desert. The sun was setting, painting the sky orange and pink and purple. Saguaro cacti stood like sentinels along the road.\n\nShe parked at the top of a hill. Below us, the desert stretched out in every direction. The sky was enormous.\n\nWe sat on the hood of the truck and watched the sunset. She pointed out the first stars as they appeared.\n\n\"That's why I call myself Stargirl,\" she said. \"I love the stars. They make me feel small. But in a good way. Like I'm part of something bigger.\"\n\nI looked at her. In the fading light, she was beautiful. More beautiful than I had ever realized.\n\n\"Why me?\" I asked. \"Why did you pick me?\"\n\nShe thought about it. \"I saw you,\" she said finally. \"Really saw you. And I liked what I saw.\"\n\n\"What did you see?\"\n\nShe smiled. \"Someone who's afraid to be himself. But who might be brave enough, someday.\"\n\nI didn't know what to say to that. So I said nothing. We just sat there, watching the stars come out, one by one.",
      "quiz": [
        {
          "question": "Where did Stargirl take Leo on their first date?",
          "options": [
            "To a movie theater",
            "To a restaurant",
            "To the desert to watch the sunset",
            "To the school"
          ],
          "correctIndex": 2
        },
        {
          "question": "Why did Stargirl say she calls herself Stargirl?",
          "options": [
            "Because of a movie",
            "Because she loves stars and feeling part of something bigger",
            "Because her parents chose it",
            "Because of a song"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 19,
      "title": "Chapter 19",
      "content": "We were together. Officially.\n\nWord spread fast. Leo Borlock was dating Stargirl Caraway. The most normal guy in school was dating the weirdest girl in school.\n\nPeople didn't know what to make of it. Some thought it was sweet. Some thought it was crazy. Some thought I had lost my mind.\n\nKevin was supportive. \"She's good for you,\" he said. \"She makes you different.\"\n\n\"Different how?\" I asked.\n\n\"Better,\" he said. \"Looser. More alive.\"\n\nHe was right. When I was with Stargirl, I felt like anything was possible. I felt like I could be anyone. Do anything.\n\nShe showed me her enchanted place—a spot in the desert where she went to meditate. She taught me to listen to the silence. To feel the earth beneath me. To notice the small things.\n\nShe showed me her happy wagon—a little red wagon she pulled around, filled with things to give away. Cookies for neighbors. Cards for strangers. Small gifts for anyone who looked like they needed cheering up.\n\nShe kept a notebook she called her \"happy file,\" filled with newspaper clippings about good things that happened to people.\n\nShe saw the world differently than I did. She saw beauty where I saw ordinary. She saw possibility where I saw limits.\n\nBeing with her was like seeing the world through new eyes.\n\nI was falling in love. And for the first time in my life, I didn't care what anyone thought.",
      "quiz": [
        {
          "question": "What was Stargirl's 'enchanted place'?",
          "options": [
            "Her bedroom",
            "A spot in the desert for meditation",
            "The school cafeteria",
            "Kevin's house"
          ],
          "correctIndex": 1
        },
        {
          "question": "What was Stargirl's 'happy wagon'?",
          "options": [
            "A car she drove",
            "A red wagon filled with things to give away",
            "A shopping cart",
            "A toy from her childhood"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 20,
      "title": "Chapter 20",
      "content": "The basketball team was on a winning streak.\n\nGame after game, they won. The school was excited. Mica had never been good at sports. But this year, everything was different.\n\nAnd Stargirl was at every game. Cheering. Dancing. Playing her ukulele.\n\nShe cheered for both teams, as always. When the opposing team made a good shot, she clapped. When an opposing player fell down, she ran over to make sure he was okay.\n\nAt first, this had annoyed people. But now, with the team winning, nobody seemed to mind. They were too happy to care.\n\n\"She's our good luck charm,\" the players said. \"We can't win without her.\"\n\nBut there was a problem.\n\nOne of the games was against Glendale. It was a close game. Very close. In the final minutes, a Glendale player went down with an injury. The crowd cheered.\n\nBut not Stargirl. She ran onto the court and knelt beside the injured player. She held his hand. She talked to him softly.\n\nThe crowd went silent. The players stood still. Everyone watched.\n\nThe Glendale player was carried off the court. Stargirl walked back to the stands. The game resumed. Mica won.\n\nBut something had changed. People were looking at Stargirl differently now. Some with admiration. Some with confusion.\n\nAnd some with anger.",
      "quiz": [
        {
          "question": "How was the basketball team performing?",
          "options": [
            "They were losing every game",
            "They were on a winning streak",
            "They canceled the season",
            "They refused to play"
          ],
          "correctIndex": 1
        },
        {
          "question": "What did Stargirl do when a Glendale player got injured?",
          "options": [
            "She cheered with the crowd",
            "She ignored it",
            "She ran to help and comfort him",
            "She left the game"
          ],
          "correctIndex": 2
        }
      ]
    },
    {
      "id": 21,
      "title": "Chapter 21",
      "content": "The team made it to the state championship.\n\nThe whole town was excited. Mica had never made it this far. People were talking about it everywhere—in stores, in restaurants, on the streets.\n\nThe championship game was against Sun Valley. They were undefeated. They were huge. They were intimidating.\n\nThe game was close. Back and forth. Our team would score, then their team would score. The crowd was on the edge of their seats.\n\nStargirl cheered for both teams, as always. But this time, people minded. This was the championship. This was everything.\n\n\"Stop cheering for them!\" someone yelled at her.\n\n\"Whose side are you on?\" yelled another.\n\nBut Stargirl didn't stop. She kept cheering. For both teams. For everyone.\n\nIn the final seconds, Sun Valley scored. They won by one point.\n\nMica lost.\n\nThe crowd went silent. Then they turned to Stargirl.\n\n\"This is your fault,\" someone said.\n\n\"You jinxed us,\" said another.\n\n\"Traitor.\"\n\nI stood there, watching. I wanted to defend her. I wanted to tell them they were wrong. But I didn't. I was too shocked. Too scared.\n\nStargirl walked out of the gym alone. I didn't follow her.\n\nI should have followed her. But I didn't.\n\nThat was the beginning of the end.",
      "quiz": [
        {
          "question": "What happened at the state championship game?",
          "options": [
            "Mica won easily",
            "Mica lost by one point",
            "The game was canceled",
            "Mica refused to play"
          ],
          "correctIndex": 1
        },
        {
          "question": "Who did the crowd blame for the loss?",
          "options": [
            "The coach",
            "The referee",
            "Stargirl",
            "Leo"
          ],
          "correctIndex": 2
        }
      ]
    },
    {
      "id": 22,
      "title": "Chapter 22",
      "content": "The shunning began.\n\nIt started slowly. People stopped talking to Stargirl. They stopped sitting near her. They stopped acknowledging her existence.\n\nAt first, it was just a few people. Then more. Then everyone.\n\nThe Stargirl Effect was over. The long skirts disappeared. The ribbons came out of hair. The random acts of kindness stopped.\n\nPeople who had imitated her now pretended they never had. People who had admired her now acted like they didn't know her.\n\nShe was invisible. She was nothing. She was erased.\n\nAnd it spread to me too.\n\nPeople stopped talking to me. They stopped inviting me to things. They stopped looking at me.\n\n\"It's because of her,\" Kevin said. \"They're punishing you because you're with her.\"\n\n\"What should I do?\" I asked.\n\n\"I don't know,\" he said. \"But something. You have to do something.\"\n\nI knew he was right. I couldn't take it. The silence. The isolation. The feeling of being erased.\n\nI wasn't strong like Stargirl. I needed other people. I needed to belong.\n\nI was starting to crack.",
      "quiz": [
        {
          "question": "What was 'the shunning'?",
          "options": [
            "A dance",
            "People ignoring and excluding Stargirl",
            "A celebration",
            "A sports event"
          ],
          "correctIndex": 1
        },
        {
          "question": "How did the shunning affect Leo?",
          "options": [
            "He wasn't affected",
            "People started ignoring him too",
            "He became more popular",
            "He moved away"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 23,
      "title": "Chapter 23",
      "content": "I went to see Archie.\n\nArchie Brubaker was a retired paleontologist who lived in town. He was wise. He knew things. Kids went to him for advice.\n\nI told him about Stargirl. About the shunning. About how I felt.\n\n\"She's different,\" I said. \"Too different. She doesn't fit in.\"\n\n\"And that's a problem?\" Archie asked.\n\n\"Yes,\" I said. \"People don't like different. They want normal.\"\n\nArchie nodded. \"That's true. Most people are afraid of different. They want everyone to be the same.\"\n\n\"So what should I do?\"\n\nHe looked at me for a long time. \"What do you want?\" he asked.\n\n\"I want to be with her,\" I said. \"But I also want to be accepted. I want both.\"\n\n\"You can't have both,\" he said. \"Not with her. She's too unique. Too herself. The world isn't ready for her.\"\n\n\"So I have to choose?\"\n\n\"You have to choose,\" he confirmed. \"Between her and them. Between being different and fitting in.\"\n\nI sat there, thinking. It seemed like an impossible choice. How could I give up either one?\n\nBut deep down, I think I already knew what I would choose. I already knew which way I would go.\n\nAnd it filled me with shame.",
      "quiz": [
        {
          "question": "Who was Archie Brubaker?",
          "options": [
            "A teacher at the school",
            "A retired paleontologist who gave advice",
            "Leo's father",
            "A basketball coach"
          ],
          "correctIndex": 1
        },
        {
          "question": "What did Archie tell Leo?",
          "options": [
            "To stay with Stargirl no matter what",
            "That he had to choose between her and fitting in",
            "To move to a new school",
            "That people would eventually accept Stargirl"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 24,
      "title": "Chapter 24",
      "content": "I asked her to change.\n\nWe were at her enchanted place in the desert. The sun was setting. The sky was beautiful. But I couldn't enjoy it.\n\n\"You have to be more normal,\" I said.\n\nShe looked at me. \"Normal?\"\n\n\"Yes. Normal. Like everyone else. Stop singing to people. Stop wearing weird clothes. Stop cheering for the other team. Just... fit in.\"\n\nShe was quiet for a long time. When she finally spoke, her voice was sad.\n\n\"You want me to be someone else,\" she said.\n\n\"No,\" I said. \"I want you to be... less you.\"\n\nAs soon as I said it, I knew how terrible it sounded. But it was too late to take it back.\n\nShe nodded slowly. \"Okay,\" she said.\n\n\"Okay?\"\n\n\"I'll try,\" she said. \"For you. I'll try to be normal.\"\n\nI should have felt happy. I should have felt relieved. But I didn't. I felt like I had just done something terrible. Something unforgivable.\n\nI had asked the most extraordinary person I knew to become ordinary. I had asked a star to stop shining.\n\nAnd she had agreed. For me.\n\nWhat kind of person does that? What kind of person asks someone to give up who they are?\n\nThe answer was clear: me. I was that kind of person.\n\nAnd I hated myself for it.",
      "quiz": [
        {
          "question": "What did Leo ask Stargirl to do?",
          "options": [
            "To leave the school",
            "To be more normal and fit in",
            "To break up with him",
            "To move away"
          ],
          "correctIndex": 1
        },
        {
          "question": "How did Stargirl respond to Leo's request?",
          "options": [
            "She refused completely",
            "She agreed to try for him",
            "She got angry and left",
            "She laughed at him"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 25,
      "title": "Chapter 25",
      "content": "She became Susan.\n\nThe next day at school, Stargirl was gone. In her place was Susan Caraway. Just Susan. Normal Susan.\n\nShe wore regular clothes. Jeans. A plain shirt. No long skirts. No ribbons. No flowers.\n\nShe didn't carry her ukulele. She didn't have Cinnamon on her shoulder. She didn't sing or dance or cheer for the other team.\n\nShe was quiet. She was ordinary. She was invisible.\n\nPeople noticed. Of course they noticed.\n\n\"What happened to Stargirl?\" they asked.\n\n\"She's gone,\" I said. \"This is Susan now.\"\n\nThey looked at her. They looked at me. They shrugged.\n\nBut they didn't start talking to us. They didn't stop shunning us. Nothing changed.\n\nSusan tried harder. She tried to join conversations. She tried to laugh at jokes. She tried to be like everyone else.\n\nBut it wasn't working. People still avoided her. People still avoided me.\n\nI had taken away everything that made her special. And it hadn't made any difference. We were still outsiders.\n\nI watched her trying to fit in, and I felt sick. This wasn't the girl I had fallen in love with. This was a shadow. A ghost.\n\nI had killed Stargirl. And Susan was what was left.\n\nWhat had I done?",
      "quiz": [
        {
          "question": "What did Stargirl do to try to fit in?",
          "options": [
            "She became more herself",
            "She became 'Susan' and acted normal",
            "She left the school",
            "She started a club"
          ],
          "correctIndex": 1
        },
        {
          "question": "Did people accept Susan after she changed?",
          "options": [
            "Yes, everyone loved her",
            "No, they still shunned her",
            "She became very popular",
            "Teachers praised her"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 26,
      "title": "Chapter 26",
      "content": "The Ocotillo Ball was coming.\n\nIt was the biggest dance of the year. Everyone went. Everyone dressed up. Everyone had a date.\n\nSusan wanted to go. She wanted to go as a normal girl, with a normal date, doing normal things.\n\n\"Will you take me?\" she asked.\n\n\"Of course,\" I said.\n\nShe smiled. It was a Susan smile, not a Stargirl smile. Smaller. Dimmer. Less bright.\n\nShe bought a regular dress. Not a long flowing thing with embroidery. Just a simple dress from a department store.\n\nShe did her hair in a normal way. No ribbons. No braids. Just a simple ponytail.\n\nShe looked pretty. But she didn't look like herself.\n\nThe night of the dance, I picked her up at her house. Her parents were there. They seemed confused. They kept looking at her like they didn't recognize her.\n\nI understood. I didn't recognize her either.\n\nWe drove to the school in silence. I kept glancing at her, looking for Stargirl. But she wasn't there. Only Susan.\n\n\"Are you okay?\" I asked.\n\n\"I'm fine,\" she said. But her voice was flat. Empty.\n\nWe pulled into the parking lot. Music was playing inside. Lights were flashing. People were laughing.\n\n\"Ready?\" I asked.\n\nShe took a deep breath. \"Ready,\" she said.\n\nWe walked in together.",
      "quiz": [
        {
          "question": "What was the Ocotillo Ball?",
          "options": [
            "A sports game",
            "The biggest dance of the year",
            "A school play",
            "A graduation ceremony"
          ],
          "correctIndex": 1
        },
        {
          "question": "How did Susan prepare for the dance?",
          "options": [
            "She wore her usual Stargirl outfit",
            "She wore a simple, normal dress",
            "She didn't go",
            "She wore her ukulele"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 27,
      "title": "Chapter 27",
      "content": "The dance was a disaster. At least for us.\n\nWe walked in, and nobody noticed. Nobody said hello. Nobody acknowledged our existence.\n\nWe stood by the punch bowl. We watched others dance. We waited for someone to talk to us.\n\nNo one did.\n\nSusan kept smiling. Kept trying. She would wave at people. They would look away. She would try to join conversations. They would end.\n\nI could see her breaking. Piece by piece. Her smile was getting smaller. Her eyes were getting sadder.\n\n\"Let's dance,\" I said.\n\nWe went to the dance floor. We danced together. Just the two of us, surrounded by people who pretended we weren't there.\n\nAnd then something happened.\n\nSomeone announced the king and queen of the Ocotillo Ball.\n\n\"The queen is... Susan Caraway!\"\n\nSusan froze. I froze. Everyone froze.\n\nThen she walked to the stage. Slowly. Uncertain. The crowd parted for her, but not out of respect. Out of avoidance.\n\nShe stood on the stage. They put a crown on her head. She looked out at the crowd.\n\nAnd I could see it in her eyes. The realization. This wasn't acceptance. This was something else. Something cruel.\n\nBut she didn't run. She didn't cry. She just stood there, wearing her crown, looking at all those faces that refused to look back at her.",
      "quiz": [
        {
          "question": "How were Leo and Susan treated at the dance?",
          "options": [
            "Everyone welcomed them",
            "They were ignored completely",
            "They were the most popular couple",
            "Teachers talked to them"
          ],
          "correctIndex": 1
        },
        {
          "question": "What surprising thing happened at the dance?",
          "options": [
            "Leo won an award",
            "Susan was named queen of the ball",
            "Stargirl sang a song",
            "The dance was canceled"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 28,
      "title": "Chapter 28",
      "content": "Then something magical happened.\n\nThe band started playing a bunny hop. Susan was still on the stage, still wearing her crown. She looked lost. Defeated.\n\nAnd then she started to dance.\n\nNot a Susan dance. A Stargirl dance. Wild. Free. Uninhibited.\n\nShe kicked off her shoes. She let down her hair. She twirled and spun and leaped.\n\nThe crowd watched. At first they laughed. Then they stopped laughing. Then they started to move.\n\nOne person joined her. Then another. Then another.\n\nSoon the whole dance floor was moving. Everyone was doing the bunny hop. Everyone was dancing with Stargirl.\n\nBecause that's who she was again. Not Susan. Stargirl.\n\nShe had come back. In that moment, on that dance floor, she had come back.\n\nI stood on the sidelines, watching. I should have been out there with her. I should have been dancing beside her.\n\nBut I wasn't. I was too scared. Too worried about what people would think.\n\nShe danced and danced. The whole gym was alive with movement and music and joy.\n\nAnd then she looked at me. Across the crowded dance floor, she looked at me.\n\nAnd I saw it in her eyes. Sadness. Disappointment. Goodbye.\n\nShe turned and danced out the door. I never saw her again.",
      "quiz": [
        {
          "question": "What happened when Susan started dancing at the ball?",
          "options": [
            "Everyone left",
            "She transformed back into Stargirl and everyone joined her",
            "She fell down",
            "The music stopped"
          ],
          "correctIndex": 1
        },
        {
          "question": "What did Leo do during Stargirl's triumphant dance?",
          "options": [
            "He joined her immediately",
            "He stayed on the sidelines watching",
            "He left the dance",
            "He started the conga line"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 29,
      "title": "Chapter 29",
      "content": "She was gone.\n\nThe next day, her desk was empty. The day after that, still empty. And the day after that.\n\nI went to her house. No one answered. The curtains were drawn. The yellow pickup truck was gone.\n\nI asked around. Nobody knew anything. Nobody had seen her. Nobody knew where she went.\n\nIt was like she had never existed. Like she had been a dream. A beautiful, impossible dream.\n\nI went to Archie's house.\n\n\"She's gone,\" I told him.\n\nHe nodded. \"I know.\"\n\n\"Where did she go?\"\n\n\"I don't know,\" he said. \"But wherever she is, she's being Stargirl. That's all she knows how to be.\"\n\n\"Will she come back?\"\n\nHe looked at me sadly. \"I don't think so, Leo. She gave you a gift. She showed you what it means to be free. To be yourself. What you do with that gift is up to you.\"\n\nI didn't feel like I had received a gift. I felt like I had lost something precious. Something irreplaceable.\n\nI walked home slowly. The streets felt empty. The world felt gray.\n\nStargirl was gone. And it was my fault.",
      "quiz": [
        {
          "question": "What did Leo discover the day after the dance?",
          "options": [
            "Stargirl was waiting for him",
            "Stargirl was gone",
            "Stargirl had transferred to another class",
            "Stargirl was sick"
          ],
          "correctIndex": 1
        },
        {
          "question": "What did Archie say Stargirl had given Leo?",
          "options": [
            "Money",
            "A book",
            "A gift of showing what it means to be free",
            "Her ukulele"
          ],
          "correctIndex": 2
        }
      ]
    },
    {
      "id": 30,
      "title": "Chapter 30",
      "content": "Life went on.\n\nSchool continued. People talked. People laughed. People forgot.\n\nWithin weeks, it was like Stargirl had never existed. Her name stopped being mentioned. The long skirts disappeared for good. The random acts of kindness stopped.\n\nEveryone went back to normal. Everyone went back to being the same.\n\nEveryone except me.\n\nI couldn't forget her. I couldn't stop thinking about her. I saw her everywhere—in the hallways, in the courtyard, in the desert sunset.\n\nI kept her gifts. The flower. The origami crane. The notes. I kept them in a box in my closet, next to my uncle's porcupine necktie.\n\nSome nights I would take them out and look at them. I would read her notes. I would remember.\n\nAnd I would wonder: Where was she now? What was she doing? Was she happy?\n\nI hoped she was happy. I hoped she had found a place where she could be herself. A place where people appreciated her. A place where she didn't have to change.\n\nI hoped she had found what I was too afraid to give her.\n\nAcceptance. Love. Freedom to be who she was.\n\nI had failed her. I knew that. I would carry that knowledge with me forever.\n\nBut maybe, somewhere out there, she had found someone who wouldn't fail her. Someone braver than me.",
      "quiz": [
        {
          "question": "How did the school react after Stargirl left?",
          "options": [
            "Everyone kept talking about her",
            "Life went on and people forgot about her",
            "They built a memorial",
            "Everyone changed to be like her"
          ],
          "correctIndex": 1
        },
        {
          "question": "What did Leo keep from Stargirl?",
          "options": [
            "Nothing",
            "Her gifts and notes in a box",
            "Her ukulele",
            "Her rat Cinnamon"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 31,
      "title": "Chapter 31",
      "content": "Years passed.\n\nI graduated from high school. I went to college. I got a job. I moved away from Mica.\n\nBut I never forgot Stargirl.\n\nShe was always there, in the back of my mind. A memory. A lesson. A reminder of what I had lost.\n\nI dated other girls. Some were nice. Some were pretty. Some were smart. But none of them were Stargirl.\n\nNone of them made me feel the way she did. None of them showed me the world the way she did. None of them were as brave, as free, as wonderfully strange.\n\nI often wondered what happened to her. I looked for her sometimes—on the internet, in phone books, in random crowds. But I never found her.\n\nIt was like she had vanished. Like she had returned to the stars she was named for.\n\nKevin and I stayed in touch. We talked about her sometimes.\n\n\"You know,\" he said once, \"I think she changed us. All of us. Even if we don't remember it.\"\n\n\"What do you mean?\" I asked.\n\n\"I mean, we're all a little different because of her. A little braver. A little kinder. A little more willing to be ourselves.\"\n\nI thought about that. Maybe he was right. Maybe Stargirl had left something behind after all.\n\nMaybe her gift was bigger than I realized.",
      "quiz": [
        {
          "question": "What happened to Leo after high school?",
          "options": [
            "He stayed in Mica forever",
            "He graduated, went to college, and moved away",
            "He became a teacher",
            "He found Stargirl"
          ],
          "correctIndex": 1
        },
        {
          "question": "What did Kevin believe about Stargirl's impact?",
          "options": [
            "She had no impact",
            "She changed everyone, making them braver and kinder",
            "She made everyone worse",
            "She was quickly forgotten"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 32,
      "title": "Chapter 32",
      "content": "I went back to Mica once.\n\nIt was years later. I was passing through on a business trip. I decided to stop and see the old places.\n\nI drove past the high school. It looked smaller than I remembered. I drove past the gym where she had danced. Past the courtyard where she had read her books.\n\nI drove out to the desert, to her enchanted place. I sat there as the sun went down, watching the sky turn colors.\n\nI thought about her. About us. About what might have been.\n\nIf I had been braver. If I had cared less about what people thought. If I had danced with her instead of watching from the sidelines.\n\nWould things have been different? Would she still be here?\n\nI would never know. That was my punishment. That was my regret.\n\nI drove to Archie's house. He was old now, but still sharp. Still wise.\n\n\"Do you ever hear from her?\" I asked.\n\n\"Sometimes,\" he said. \"A postcard here and there. From different places.\"\n\n\"Is she happy?\"\n\nHe smiled. \"She's Stargirl. She's always happy.\"\n\nI nodded. That was good. That was all I needed to know.\n\nI left Mica that night. I never went back.",
      "quiz": [
        {
          "question": "Why did Leo return to Mica?",
          "options": [
            "To find Stargirl",
            "He was passing through on a business trip",
            "For a reunion",
            "To visit family"
          ],
          "correctIndex": 1
        },
        {
          "question": "What did Archie tell Leo about Stargirl?",
          "options": [
            "She was sad",
            "She sometimes sent postcards and was always happy",
            "She had married",
            "She had returned to Mica"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 33,
      "title": "Chapter 33",
      "content": "And then, on my birthday, I received a package.\n\nThere was no return address. Just my name and address, written in handwriting I didn't recognize.\n\nI opened it carefully. Inside was a box. And inside the box was a porcupine necktie.\n\nNot my uncle's necktie. A new one. But almost identical. The same colors. The same style. The same porcupine.\n\nThere was a note:\n\n\"Happy birthday. I never forgot.\"\n\nNo signature. But I knew. I knew who it was from.\n\nShe had remembered. After all these years. She had remembered my story about my uncle Pete. She had remembered me.\n\nI sat there, holding the necktie, tears streaming down my face.\n\nShe was out there somewhere. Still thinking of others. Still giving gifts. Still being Stargirl.\n\nI put on the necktie. It fit perfectly.\n\nI looked at myself in the mirror. And for the first time in years, I smiled. A real smile. A Stargirl smile.\n\nShe had given me one more gift. One more reminder.\n\nBe brave. Be yourself. Be like the stars.\n\nShine.",
      "quiz": [
        {
          "question": "What did Leo receive on his birthday?",
          "options": [
            "A letter from Stargirl",
            "A porcupine necktie",
            "Her ukulele",
            "A photo"
          ],
          "correctIndex": 1
        },
        {
          "question": "Why was the porcupine necktie significant?",
          "options": [
            "It was expensive",
            "Stargirl remembered his story about Uncle Pete",
            "It was his father's",
            "Kevin gave it to him"
          ],
          "correctIndex": 1
        }
      ]
    },
    {
      "id": 34,
      "title": "Epilogue: More Than Stars",
      "content": "I still have the necktie.\n\nBoth of them, actually. My uncle Pete's and the one from Stargirl. I keep them together in a drawer, side by side.\n\nSometimes I take them out and look at them. Two porcupine neckties. Two gifts from people who understood something I'm still trying to learn.\n\nBe different. Be yourself. Don't be afraid.\n\nI'm older now. Wiser, maybe. I understand things I didn't understand back then. I see things I missed.\n\nStargirl wasn't weird. She wasn't crazy. She was awake. She was alive. She was everything the rest of us were too scared to be.\n\nShe saw the world as it could be, not as it was. She saw people as they could be, not as they were. She believed in the best of everyone, including me.\n\nEspecially me.\n\nI let her down. I know that. I'll always know that. But I also know that she forgave me. The necktie proved that.\n\nShe forgave me. And maybe, someday, I'll learn to forgive myself.\n\nIn the meantime, I try to live the way she would have wanted. I try to be brave. I try to be kind. I try to notice the things that matter.\n\nI try to be a little more like Stargirl every day.\n\nAnd when I look up at the night sky, I smile. Because I know she's out there somewhere, dancing under the stars.\n\nMy Stargirl. My forever star.\n\nMore than stars.",
      "quiz": [
        {
          "question": "What did Leo finally understand about Stargirl?",
          "options": [
            "She was crazy",
            "She was awake and alive, everything others were too scared to be",
            "She was pretending",
            "She was ordinary"
          ],
          "correctIndex": 1
        },
        {
          "question": "What is the main message of the story?",
          "options": [
            "Fit in at all costs",
            "Be brave, be yourself, don't be afraid to be different",
            "Never trust anyone",
            "Popularity is everything"
          ],
          "correctIndex": 1
        }
      ]
    }
  ]
}